[
    {
        "section_number": 1,
        "chapter_name": "Chapter 1",
        "company_name": "Unknown",
        "full_text": " \n \n      \n \nADITYA INFOTECH LIMITED \n \nOur Company was incorporated as ‘Perfect Lucky Goldstar International Limited’ at New Delhi, as a public limited company under the Companies Act, 1956, pursuant to a certificate of incorporation dated March 27, \n1995 issued by the RoC and commenced its business pursuant to a certificate for commencement of business dated April 21, 1995. Subsequently, pursuant to a resolution passed by our Shareholders in the annual general \nmeeting held on August 6, 1997, the name of our Company was changed from ‘Perfect Lucky Goldstar International Limited’ to ‘Aditya Infotech Limited’, to reflect the main objects and activities of the Company more \nprecisely, and consequently, a fresh certificate of incorporation dated September 11, 1997 was issued by the RoC to our Company. For further details on the changes in the name and registered office of our Company, \nsee “History and Certain Corporate Matters” on page 249 of the Draft Red Herring Prospectus. \nCorporate Identity Number: U74899DL1995PLC066784; \nRegistered Office: F-28, Okhla Industrial Area, Phase -1, New Delhi – 110 020, Delhi, India;  \nCorporate Office: A-12, Sector 4, Noida – 201 301, Uttar Pradesh, India; \nWebsite: www.adityagroup.com; Telephone: +91 120 4555 666; \nContact Person: Roshni Tandon, Company Secretary and Compliance Officer; E-mail: companysecretary@adityagroup.com  \n NOTICE TO INVESTORS: ADDENDUM TO THE DRAFT RED HERRING PROSPECTUS (THE “ADDENDUM”) \nTHE PROMOTERS OF OUR COMPANY ARE HARI SHANKER KHEMKA, ADITYA KHEMKA, ANANMAY KHEMKA, RISHI KHEMKA AND HARI KHEMKA BUSINESS FAMILY TRUST \nINITIAL PUBLIC OFFERING OF UP TO [●] EQUITY SHARES OF FACE VALUE OF ₹1 EACH OF OUR COMPANY (“EQUITY SHARES”) FOR CASH AT A PRICE OF ₹[●] PER EQUITY SHARE (INCLUDING A \nSHARE PREMIUM OF ₹[●] PER EQUITY SHARE) (“OFFER PRICE”) AGGREGATING UP TO ₹13,000.00 MILLION (THE “OFFER”). THE OFFER COMPRISES OF A FRESH ISSUE OF UP TO [●] EQUITY SHARES \nOF FACE VALUE OF ₹1 EACH AGGREGATING UP TO ₹5,000.00 MILLION (“FRESH ISSUE”) AND AN OFFER FOR SALE OF UP TO [●] EQUITY SHARES OF FACE VALUE ₹1 EACH (“OFFERED SHARES”) \nAGGREGATING UP TO ₹8,000.00 MILLION COMPRISING UP TO [●] EQUITY SHARES OF FACE VALUE OF ₹1 EACH AGGREGATING UP TO ₹5,240.04 MILLION BY ADITYA KHEMKA, UP TO [●] EQUITY \nSHARES OF FACE VALUE OF ₹1 EACH AGGREGATING UP TO ₹123.16 MILLION BY ANANMAY KHEMKA, UP TO [●] EQUITY SHARES OF FACE VALUE OF ₹1 EACH AGGREGATING UP TO ₹2,000.00 \nMILLION BY RISHI KHEMKA (COLLECTIVELY, THE “PROMOTER SELLING SHAREHOLDERS”), UP TO [●] EQUITY SHARES OF FACE VALUE OF ₹1 EACH AGGREGATING UP TO ₹426.40 MILLION BY \nHARI SHANKAR KHEMKA (HUF), UP TO [●] EQUITY SHARES OF FACE VALUE OF ₹1 EACH AGGREGATING UP TO ₹198.90 MILLION BY SHRADHA KHEMKA AND UP TO [●] EQUITY SHARES OF FACE \nVALUE OF ₹1 EACH AGGREGATING UP TO ₹11.50 MILLION BY ADITYA KHEMKA (HUF) (COLLECTIVELY, THE “PROMOTER GROUP SELLING SHAREHOLDERS” AND TOGETHER WITH THE \nPROMOTER SELLING SHAREHOLDERS, THE “SELLING SHAREHOLDERS”), AND SUCH OFFER FOR SALE OF EQUITY SHARES BY THE SELLING SHAREHOLDERS, THE “OFFER FOR SALE”). THIS \nOFFER INCLUDES A RESERVATION OF UP TO [●] EQUITY SHARES OF FACE VALUE OF ₹1 EACH AGGREGATING UP TO ₹[●] (CONSTITUTING UP TO [●]% OF THE POST-OFFER PAID-UP EQUITY SHARE \nCAPITAL) FOR PURCHASE BY ELIGIBLE EMPLOYEES (THE “EMPLOYEE RESERVATION PORTION”). THE OFFER LESS THE EMPLOYEE RESERVATION PORTION IS HEREINAFTER REFERRED TO \nAS THE “NET OFFER”. THE OFFER AND THE NET OFFER WOULD CONSTITUTE [●]% AND [●]%, RESPECTIVELY, OF OUR POST-OFFER PAID-UP EQUITY SHARE CAPITAL. OUR COMPANY, IN \nCONSULTATION WITH THE BRLMS, MAY OFFER A DISCOUNT OF UP TO [●]% (EQUIVALENT TO ₹[●] PER EQUITY SHARE) TO THE OFFER PRICE TO ELIGIBLE EMPLOYEES BIDDING IN THE \nEMPLOYEE RESERVATION PORTION (“EMPLOYEE DISCOUNT”). \nPotential Bidders may note that at the time of filing of the Draft Red Herring Prospectus, our Company had identified Hari Shanker Khemka, Aditya Khemka, Ananmay Khemka and Hari Khemka Business Family Trust as the Promoters \nof our Company and Rishi Khemka was identified as one of the members of the Promoter Group by virtue of being the immediate relative of Hari Shanker Khemka and Aditya Khemka. Our Company has decided to also identify Rishi \nKhemka as one of the Promoters of our Company and accordingly, the various sections of the Draft Red Herring Prospectus, including the cover page and sections titled “Definitions and Abbreviations”, “Summary of the Offer Document”, \n“Capital Structure”, “Objects of the Offer”, “History and Certain Corporate Matters”, “Our Promoters and Promoter Group”, and “Other Regulatory and Statutory Disclosures” beginning on pages 6, 27, 99, 116, 249, 280 and 404, \nrespectively of the Draft Red Herring Prospectus stands updated in the manner set out herein in this Addendum.  \n \nAll references to the term “Promoter” in the Draft Red Herring Prospectus, will include Rishi Khemka, along with Hari Shanker Khemka, Aditya Khemka, Ananmay Khemka and Hari Khemka Business Family Trust. All the necessary \nupdates to the Draft Red Herring Prospectus in this regard will be carried out in the Red Herring Prospectus and the Prospectus, as and when they are filed with the RoC, SEBI and the Stock Exchanges. \n \nPotential Bidders may note that in order to assist the Bidders to get a complete understanding of the updated information, the updated relevant portions of the cover page and sections titled “Definitions and Abbreviations”, “Summary of \nthe Offer Document”, “Capital Structure”, “Objects of the Offer”, “History and Certain Corporate Matters”, “Our Promoters and Promoter Group”, and “Other Regulatory and Statutory Disclosures” have been included in this \nAddendum. The abovementioned changes are to be read in conjunction with the Draft Red Herring Prospectus and accordingly their references in the Draft Red Herring Prospectus stands updated pursuant to this Addendum. The \ninformation in this Addendum supplements the Draft Red Herring Prospectus and updates the information in the Draft Red Herring Prospectus, as applicable. However, this Addendum does not reflect all the changes that have occurred \nbetween the date of filing of the Draft Red Herring Prospectus and the date hereof, and accordingly does not include all the changes and/or updates that will be included in the Red Herring Prospectus and the Prospectus. Please note that \nall other details / information included in the Draft Red Herring Prospectus will be suitably updated, including to the extent stated in this Addendum, as may be applicable, in the Red Herring Prospectus and the Prospectus, as and when \nfiled with the RoC, SEBI and the Stock Exchanges. Investors should not rely on the Draft Red Herring Prospectus or this Addendum for any investment decision, and should read the Red Herring Prospectus, as and when it is filed with \nthe RoC, SEBI and the Stock Exchanges before making an investment decision with respect to the Offer.  \n \nThe Equity Shares have not been and will not be registered under the U.S. Securities Act of 1933, (the “U.S. Securities Act”) or any state securities laws in the United States, and unless so registered, and may not be offered or sold within \nthe United States, except pursuant to an exemption from, or in a transaction not subject to, the registration requirements of the U.S. Securities Act and applicable U.S. state securities laws. Accordingly, the Equity Shares are being offered \nand sold outside the United States in “offshore transactions” as defined in and in reliance on, Regulation S under the U.S. Securities Act and the applicable laws of the jurisdictions where such offers and sales are made. \n \nThe Equity Shares have not been and will not be registered, listed or otherwise qualified in any other jurisdiction outside India and may not be offered or sold, and Bids may not be made by persons in any such jurisdiction, except in \ncompliance with the applicable laws of such jurisdiction. \n \nThis Addendum which has been filed with SEBI and the Stock Exchanges shall be made available to the public for comments, if any, for a period of at least 21 days, from the date of such filing with SEBI and will be available on their \nwebsite www.sebi.gov.in, the websites of the Stock Exchanges i.e., www.nseindia.com, www.bseindia.com, the website of the Company i.e. www.adityagroup.com, and the websites of BRLMs, i.e., ICICI Securities Limited at \nwww.icicisecurities.com and IIFL Capital Services Limited (formerly known as IIFL Securities Limited) at www.iiflcap.com. All capitalized terms used in this Addendum shall, unless the context otherwise requires, have the meaning \nascribed to them in the Draft Red Herring Prospectus.  \n \n \n \n \nPlace: Noida \nDate: December 17, 2024 \nFor Aditya Infotech Limited \nOn behalf of the Board of Directors \n \nSd/- \nRoshni Tandon \nCompany Secretary and Compliance Officer \nBOOK RUNNING LEAD MANAGERS \nREGISTRAR TO THE OFFER \n \n \nICICI Securities Limited \nICICI Venture House, \nAppasaheb Marathe Marg, Prabhadevi \nMumbai – 400 025 \nMaharashtra, India \nTelephone: + 91 22 6807 7100 \nE-mail: ailipo@icicisecurities.com \nInvestor Grievance E-mail: customercare@icicisecurities.com \nWebsite: www.icicisecurities.com \nContact person: Ashik Joisar / Sumit Singh \nSEBI Registration No.: INM000011179 \nIIFL Capital Services Limited (formerly known as IIFL Securities Limited)  \n24th Floor, One Lodha Place \nSenapati Bapat Marg, Lower Parel (W) \nMumbai – 400 013  \nMaharashtra, India \nTelephone: + 91 22 4646 4728 \nE-mail: adityainfotech.ipo@iiflcap.com \nInvestor Grievance E-mail: ig.ib@iiflcap.com \nWebsite: www.iiflcap.com \nContact person: Mansi Sampat / Pawan Jain \nSEBI Registration No.: INM000010940 \nLink Intime India Private Limited  \nC-101, 247 Park, L.B.S Marg \nVikhroli (West), Mumbai – 400 083 \nMaharashtra, India  \nTelephone: + 91 810 811 4949 \nE-mail: adityainfotech.ipo@linkintime.co.in \nInvestor Grievance E-mail: \nadityainfotech.ipo@linkintime.co.in \nWebsite: www.linkintime.co.in \nContact person: Shanti Gopalkrishnan \nSEBI Registration No.: INR000004058 \nBID / OFFERPROGRAMME  \nANCHOR INVESTOR \nBIDDING DATE* \n[●] \nBID / OFFER OPENS ON \n[●] \nBID / OFFER CLOSES ON \n[●]**# \nBID / OFFER OPENS ON \n[●]* \nBID / OFFER CLOSES ON \n[●]** \n*Our Company, in consultation with the BRLMs, may consider participation by Anchor Investors in accordance with the SEBI ICDR Regulations. The Anchor Investor Bidding Date shall be one Working Day prior \nto the Bid / Offer Opening Date. \n** Our Company, in consultation with the BRLMs, may consider closing the Bid / Offer Period for QIBs one Working Day prior to the Bid / Offer Closing Date in accordance with the SEBI ICDR Regulations. \n# The UPI mandate end time and date shall be at 5:00 p.m. on the Bid/Offer Closing Date. \n \n \nTHIS IS A PUBLIC ANNOUNCEMENT FOR INFORMATION PURPOSES ONLY. THIS IS NOT A PROSPECTUS ANNOUNCEMENT AND DOES NOT CONSTITUTE AN INVITATION OR \nOFFER TO ACQUIRE, PURCHASE OR SUBSCRIBE FOR UNITS OR SECURITIES. \nNOT FOR RELEASE, PUBLICATION OR DISTRIBUTION, DIRECTLY OR INDIRECTLY OUTSIDE INDIA. \n \n \n(Please scan this QR Code \nto view the Addendum) \n \n \n",
        "tables": [],
        "key_findings": "Aditya Infotech is a public limited company based in New Delhi, India. The Company was incorporated as ‘Perfect Lucky Goldstar International Limited’ on March 27, 1995. On August 6, 1997, the name of our Company was changed from ‘ perfect lucky goldstar’ to ‘aditya infotech’. A fresh certificate of incorporation was issued by the RoC on September 11, 1997. The Company has offered to sell shares at an offer price of up to ₹13,000.00 million (the “offer”) The shares are being sold at a price of. ⁹[●] PER EQUITY SHARE (INCLUDING A SHARE PREMIUM OF. ≹[ ●] PER SHARE) (“OFFER PRICE’) This OFFER includes a RESERVATION of up to [●] EQUITY SHARES OF FACE VALUE OF ₹1 EACH AGGREGATING UP TO ⁹[●] (CONSTITUTING UP TO [ ●]% OF THE POST-OFFER PAID-UP EQUITY SHARE CAPITAL) For PURCHASE BY ELIGIBLE EMPLOYEES (THE “EMPLOYEE RESERvation PORTION”). The OFFER LESS THE EMPLoyee RESerVation Portion is HEREINAFTER REFERRED TO as the “NET OFFER”. All references to the term “Promoter” in the Draft Red Herring Prospectus, will include Rishi Khemka. The information in this Addendum supplements the Draft. Red Herred Prospectus and updates the information in the. Draft. The abovementioned changes are to be read in conjunction with the DraftRedHerringProspectus. The Equity Shares have not been and will not be registered under the U.S. Securities Act of 1933. Investors should not rely on the Draft Red Herring Prospectus or this Addendum for any investment decision. The Equity Shares are being offered and sold outside the United States in “offshore transactions” All capitalized terms used in this Addendum shall, unless the context otherwise requires, have the meaning ascribed to them in the Draft Red Herring Prospectus. Place: Noida Date: December 17, 2024 For Aditya Infotech Limited. Anchor Investor Bidding Date shall be one Working Day prior to the Bid / Offer Opening Date. # The UPI mandate end time and date shall be at 5:00 p.m. on the Bid/Offer Closing Date."
    },
    {
        "section_number": 2,
        "chapter_name": "Chapter 2",
        "company_name": "Unknown",
        "full_text": " \n \n \nTABLE OF CONTENTS \n \nSECTION I – GENERAL .................................................................................................................................... 2 \nDEFINITIONS AND ABBREVIATIONS ....................................................................................................... 2 \nSECTION II – SUMMARY OF THE OFFER DOCUMENT .......................................................................... 3 \nSECTION IV – INTRODUCTION ..................................................................................................................... 6 \nCAPITAL STRUCTURE ................................................................................................................................. 6 \nOBJECTS OF THE OFFER ........................................................................................................................... 13 \nHISTORY AND CERTAIN CORPORATE MATTERS ............................................................................... 14 \nSECTION V – ABOUT OUR COMPANY ....................................................................................................... 16 \nOUR PROMOTERS AND PROMOTER GROUP ........................................................................................ 16 \nSECTION IX - OTHER REGULATORY AND STATUTORY DISCLOSURES ....................................... 23 \nDECLARATION ................................................................................................................................................ 24 \n \n \n \n \n",
        "tables": [],
        "key_findings": "Table of Contents. In this section, we look at the history, history and corporate matters of the company. We also look at some of the issues surrounding the company's promotional activities."
    },
    {
        "section_number": 3,
        "chapter_name": "Chapter 3",
        "company_name": "Unknown",
        "full_text": " \n2 \nSECTION I – GENERAL \n \nDEFINITIONS AND ABBREVIATIONS \n \nThe following definitions shall added / replaced as applicable, the respective definitions in the section “Definitions \nand Abbreviations” beginning on page 6 of the Draft Red Herring Prospectus. \n \nCompany-related terms \n \nTerm \nDescription \nPromoter(s) \nThe promoters of our Company, namely Hari Shanker Khemka, Aditya Khemka, Ananmay \nKhemka, Rishi Khemka and Hari Khemka Business Family Trust. For details, see “Our \nPromoters and Promoter Group” on page 16 of this Addendum \nPromoter \nSelling \nShareholder(s) \nAditya Khemka, Ananmay Khemka and Rishi Khemka \nPromoter Group Selling \nShareholders \nHari Shankar Khemka (HUF), Shradha Khemka and Aditya Khemka (HUF) \n \nOffer-related terms \n \nTerm \nDescription \nAddendum \nThe addendum dated December 17, 2024 to the Draft Red Herring Prospectus, filed by our \nCompany with SEBI and Stock Exchanges \nDraft \nRed \nHerring \nProspectus / DRHP \nThe draft red herring prospectus dated September 30, 2024, read with Addendum filed with \nSEBI and Stock Exchanges and issued in accordance with the SEBI ICDR Regulations, which \ndid not contain complete particulars of the price at which the Equity Shares will be Allotted \nand the size of the Offer, and any other addenda or corrigenda thereto \n \n \n \n",
        "tables": [],
        "key_findings": "The following definitions shall added / replaced as applicable, the respective definitions in the section “Definitions and Abbreviations” beginning on page 6 of the Draft Red Herring Prospectus. Company-related terms Term Description Promoter(s) The promoters of our Company, namely Hari Shanker Khemka."
    },
    {
        "section_number": 4,
        "chapter_name": "Chapter 4",
        "company_name": "Unknown",
        "full_text": " \n3 \nSECTION II – SUMMARY OF THE OFFER DOCUMENT \n \nThe following headings and corresponding disclosures set out below shall replace the respective headings and \ndisclosures in the section “Summary of the Offer Document” beginning on page 27 of the Draft Red Herring \nProspectus. \n \nName of Promoters \n \nOur Promoters are Hari Shanker Khemka, Aditya Khemka, Ananmay Khemka, Rishi Khemka and Hari Khemka \nBusiness Family Trust. For further details, see “Our Promoters and Promoter Group” on page 16 of this \nAddendum. \n \nAggregate pre-Offer and post-Offer shareholding of our Promoters, the members of our Promoter Group \n(other than our Promoters) and the Selling Shareholders \n \nThe aggregate pre-Offer and post-Offer Equity shareholding of our Promoters, the members of our Promoter \nGroup (other than our Promoters), and the Selling Shareholders, as a percentage of the pre-Offer paid-up Equity \nShare capital of our Company is set out below: \n \nS. No. \nName of \nShareholder \nPre-Offer \nPost-Offer** \nNumber of Equity \nShares of face value \nof ₹1 held as on the \ndate of this \nAddendum \nPercentage of pre-\nOffer paid-up \nEquity Share capital \nas on the date of this \nAddendum (%) \nNumber of Equity \nShares of face value \nof ₹1 held as on the \ndate of this \nAddendum \nPercentage of post-\nOffer paid-up Equity \nShare capital as on \nthe date of this \nAddendum (%) \nPromoters  \n1. \n Hari \nShanker \nKhemka^ \n19,719,250 \n17.96 \n[●]\n[●] \n2. \n Aditya Khemka*^ \n61,114,950 \n55.66 \n[●]\n[●] \n3. \n Ananmay Khemka* \n925,400 \n0.84 \n[●]\n[●] \n4. \n Rishi Khemka*^ \n14,716,749 \n13.40 \n[●]\n[●] \nTotal (A) \n96,476,349 \n87.86 \n[●]\n[●] \nMembers of the Promoter Group \n5. \n Hari \nShankar \nKhemka (HUF)# \n780,350 \n0.71 \n[●]\n[●] \n6. \n Shradha Khemka# \n464,000 \n0.42 \n[●]\n[●] \n7. \n Aditya \nKhemka \n(HUF) # \n21,050 \n0.02 \n[●]\n[●] \n8. \n Ruchi Khemka \n4,758,251 \n4.33 \n[●]\n[●] \nTotal (B) \n6,023,651 \n5.49  \n[●]\n[●] \nTotal (C = A + B) \n \n102,500,000 \n93.35  \n[●]\n[●] \n**To be updated upon finalization of the Offer Price. \n*Also a Promoter Selling Shareholder. \n#Also a Promoter Group Selling Shareholder. \n^Prior to the filing of the Red Herring Prospectus with the RoC, our individual Promoters, Hari Shanker Khemka, Aditya Khemka and Rishi \nKhemka will transfer 19,719,150 Equity Shares of face value of ₹1 each to Hari Khemka Business Family Trust, transfer 100 Equity Shares \nof face value of ₹1 each to Aditya Khemka Business Family Trust; and transfer 100 Equity Shares of face value of ₹1 each to ARK Business \nProsperity Trust, respectively. \n \nWeighted average price at which specified securities were acquired by the Promoters and the Selling \nShareholders in the last one year preceding the date of this Addendum \n \nExcept as disclosed below, no specified securities were acquired by the Promoters and the Selling Shareholders \nin the one year preceding the date of this Addendum: \n \nS. No. \nName \nNumber of Equity Shares of face \nvalue of ₹1 each acquired in the last \none year preceding the date of this \nAddendum \nWeighted average price of \nacquisition per Equity \nShare (in ₹)^ \nPromoters \n1.  Hari Shanker Khemka \n15,775,400  \nNil** \n2.  Aditya Khemka* \n48,891,960  \nNil** \n3.  Ananmay Khemka* \n740,320  \nNil** \n",
        "tables": [],
        "key_findings": "The following headings and corresponding disclosures set out below shall replace the respective headings in the section “Summary of the Offer Document” beginning on page 27 of the Draft Red Herring Prospectus. Name of Promoters Our Promoters are Hari Shanker Khemka, Aditya, Ananmay, Rishi and Hari KhemKA Business Family Trust. The Promoters will transfer 19,719,150 Equity Shares of face value of ₹1 each to Hari Khemka Business Family Trust. The Promoters and the Selling Shareholders will also transfer 100 Equity Shares to ARK Business Prosperity Trust, respectively."
    },
    {
        "section_number": 5,
        "chapter_name": "Chapter 5",
        "company_name": "Unknown",
        "full_text": " \n4 \nS. No. \nName \nNumber of Equity Shares of face \nvalue of ₹1 each acquired in the last \none year preceding the date of this \nAddendum \nWeighted average price of \nacquisition per Equity \nShare (in ₹)^ \n4.  Rishi Khemka* \n15,580,000 \nNil** \nSelling Shareholders \n5.  Hari Shankar Khemka (HUF) \n624,280  \nNil** \n6.  Shradha Khemka \n371,200 \nNil** \n7.  Aditya Khemka (HUF) \n16,840  \nNil** \n*Also a Promoter Selling Shareholder. \n**Our Company has issued bonus shares on June 17, 2024 in the ratio of four Equity Shares of face value of ₹1 each for every one Equity \nShare of face value of ₹1 each held. \n^As certified by RNBP & Co., Chartered Accountants, pursuant to their certificate dated December 17, 2024. \n \nDetails of price at which Equity Shares were acquired in the three years preceding the date of this \nAddendum  \n \nThe details of the price at which specified securities have been acquired by the Promoters, members of the \nPromoter Group, Selling Shareholders and the shareholders entitled with right to nominate directors or with any \nother such rights, in the three years preceding the date of this Addendum are set out below: \n \nS. No. \nName of the \nacquirer / \nShareholder \nDate of \nacquisition  \nNature of acquisition \nNumber of \nEquity Shares \nof face value of \n₹1 each** \nAverage cost \nof \nacquisition \nper Equity \nShare (in ₹)^ \nPromoters \n1.  \nHari \nShanker \nKhemka \nJune 17, 2024 \nBonus issue in the ratio of 4:1@ \n15,775,400$  \nNil \n2.  \nAditya Khemka* \nMarch 24, \n2023 \nGift from Hari Shanker Khemka \nand Rishi Khemka \n617,000& \nNil% \nJune 17, 2024 \nBonus issue in the ratio of 4:1@ \n48,891,960$  \nNil \n3.  \nAnanmay Khemka* \nMarch 24, \n2023 \nGift from Hari Shanker Khemka \nand Rishi Khemka \n18,500& \nNil% \nJune 17, 2024 \nBonus issue in the ratio of 4:1@ \n740,320$  \nNil \n4.  \nRishi Khemka* \nJune 17, 2024 \nBonus issue in the ratio of 4:1@ \n15,580,000$  \nNil \nSelling Shareholders \n5.  \nHari \nShanker \nKhemka (HUF)  \nJune 17, 2024 \nBonus issue in the ratio of 4:1@ \n624,280$ \nNil \n6.  \nAditya \nKhemka \n(HUF) \nJune 17, 2024 \nBonus issue in the ratio of 4:1@ \n16,840$ \nNil \n7.  \nShraddha Khemka  \nJune 17, 2024 \nBonus issue in the ratio of 4:1@ \n371,200$ \nNil \n8.  \nAnanmay Khemka \nMarch 24, \n2023 \nGift from Hari Shanker Khemka \nand Rishi Khemka \n18,500& \nNil% \n9.  \nAnanmay Khemka \nJune 17, 2024 \nBonus issue in the ratio of 4:1@ \n740,320$ \nNil \n10.  \nAditya Khemka \nMarch 24, \n2023 \nGift from Hari Shanker Khemka \nand Rishi Khemka \n617,000& \nNil$ \n11.  \nAditya Khemka \nJune 17, 2024 \nBonus issue in the ratio of 4:1@ \n48,891,960$ \nNil \n12.  \nRishi Khemka* \nJune 17, 2024 \nBonus issue in the ratio of 4:1@ \n15,580,000$  \nNil \nMembers of the Promoter Group \n13.  \nHari \nShankar \nKhemka (HUF) # \nJune 17, 2024 \nBonus issue in the ratio of 4:1@ \n624,280$  \nNil \n14.  \nAditya \nKhemka \n(HUF) # \nJune 17, 2024 \nBonus issue in the ratio of 4:1@ \n16,840$  \nNil \n15.  \nShradha Khemka# \nJune 17, 2024 \nBonus issue in the ratio of 4:1@ \n371,200$  \nNil \n16.  \nRuchi Khemka \nSeptember 26, \n2024 \nGift from Rishi Khemka \n4,758,251$ \nNil% \nShareholders with the right to nominate directors or with such rights \n17.  \nDixon \nTechnologies \n(India) Limited \nSeptember 18, \n2024 \nPreferential \nallotment \non \na \nprivate placement basis, pursuant \nto \nshare \nsubscription \nand \npurchase agreement dated July 8, \n2024, amongst our Company, \nDixon \nTechnologies \n(India) \n7,305,805$ \n340.32 \n",
        "tables": [],
        "key_findings": "Our Company has issued bonus shares on June 17, 2024 in the ratio of four Equity Shares of face value of ₹1 each for every one Equity Share of facevalue of ⁹1each held. Details of price at which Equity Shares were acquired in the three years preceding the date of this Addendum are set out below. Rishi Khemka* June 17, 2024 Bonus issue in the ratio of 4:1@ 15,580,000$ Nil Selling Shareholders 5. Hari Shanker KhemKA (HUF) June 17,. 2024 Bonusissue in the ratios of 4. 4: 1@ 740,320$ Nil 4. Aditya Khemkas March 24, 2023 Gift from Hari. Shanker and Rishi. July 8, 2024, amongst our Company, Dixon Technologies (India) 7,305,805$ 340.32"
    },
    {
        "section_number": 6,
        "chapter_name": "Chapter 6",
        "company_name": "Unknown",
        "full_text": " \n5 \nS. No. \nName of the \nacquirer / \nShareholder \nDate of \nacquisition  \nNature of acquisition \nNumber of \nEquity Shares \nof face value of \n₹1 each** \nAverage cost \nof \nacquisition \nper Equity \nShare (in ₹)^ \nLimited and AIL Dixon \n*Also a Promoter Selling Shareholder. \n#Also a Promoter Group Selling Shareholder. \n$The equity shares transacted during this period were with a face value of ₹1 per equity share. \n&The equity shares transacted during this period were with a face value of ₹10 per equity share. \n%The shares have been received as gift and no consideration paid against the same, hence the total cost has been considered as nil. \n@Pursuant to the Board resolution dated June 12, 2024, the Company approved the bonus issue of its equity shares of face value of ₹1 each \nin the ratio of 4:1 to its existing shareholders. This was further approved by the Shareholders in the EGM held on June 17, 2024. The bonus \nshares were issued without any consideration from the Shareholders, hence the cost of acquisition has been taken as ₹Nil. \n**The number of equity shares has been adjusted for the sub-division in the face value of the equity shares of our Company from ₹10 each to \n₹1 each pursuant to a resolution of the Shareholders dated June 17, 2024, as applicable. \n^As certified by RNBP & Co., Chartered Accountants, pursuant to their certificate dated December 17, 2024.  \n \nAverage cost of acquisition \n \nThe average cost of acquisition of Equity Shares by our Promoters and the Selling Shareholders as at the date of \nthis Addendum is set forth below: \n \nS. No. \nName \nNumber of Equity Shares of face \nvalue of ₹1 each \nAverage cost of acquisition per \nEquity Share (in ₹)^# \nPromoters** \n1. \n \nHari Shanker Khemka \n19,719,250 \n0.15 \n2. \n \nAditya Khemka* \n61,114,950 \n0.10 \n3. \n \nAnanmay Khemka* \n925,400 \nNil \n4. \n \nRishi Khemka* \n14,716,749 \nNil \nSelling Shareholders \n5. \n \nHari Shankar Khemka (HUF) \n7,80,350 \n0.20 \n6. \n \nShradha Khemka \n4,64,000 \n0.20 \n7. \n \nAditya Khemka (HUF) \n21,050 \n0.20 \n*Also a Promoter Selling Shareholder. \n**One of our Promoters, Hari Khemka Business Family Trust do not hold any Equity Shares of the Company, as on the date of this Addendum. \n#The average cost of acquisition of equity shares has been adjusted for the sub-division in the face value of the equity shares of our Company \nfrom ₹10 each to ₹1 each pursuant to a resolution of the Shareholders dated June 17, 2024, as applicable. \n^As certified by RNBP & Co., Chartered Accountants, pursuant to their certificate dated December 17, 2024.  \n \nFor further details of the cost of acquisition of our Promoters, see “Capital Structure – Build-up of the Promoters’ \nshareholding in our Company” on page 6 of this Addendum. \n \n \n",
        "tables": [],
        "key_findings": "The shares have been received as gift and no consideration paid against the same, hence the total cost has been considered as nil. @Pursuant to the Board resolution dated June 12, 2024, the Company approved the bonus issue of its equity shares of face value of ₹1 each in the ratio of 4:1 to its existing shareholders. This was further approved by the Shareholders in the EGM held on June 17, 2024. The average cost of acquisition of equity shares has been adjusted for the sub-division in the face value of the equity shares of our Company. Aditya Khemka (HUF) 21,050 0.20 *Also a Promoter Selling Shareholder."
    },
    {
        "section_number": 7,
        "chapter_name": "Chapter 7",
        "company_name": "Unknown",
        "full_text": " \n6 \nSECTION IV – INTRODUCTION \n \nCAPITAL STRUCTURE \n \nA. \nThe sub-section titled “– Details of Shareholding of our Promoters and members of the Promoter Group in \nthe Company – (i) Equity shareholding of the Promoters” beginning on page 104 of the Draft Red Herring \nProspectus stands replaced with the following: \n \nDetails of Shareholding of our Promoters and members of the Promoter Group in the Company \n \n(i) Equity shareholding of the Promoters \n \nAs on the date of this Addendum, our Promoters collectively hold 96,476,349 Equity Shares of face value \nof ₹1 each, equivalent to 87.86% of the issued, subscribed and paid-up Equity Share capital of our Company, \nas set forth in the table below: \n \nS. No. Name of the Shareholder \nPre-Offer Equity Share capital \nPost-Offer Equity Share capital* \nNumber of \nEquity Shares of \nface value of ₹1 \neach \nPercentage of \ntotal \nshareholding \n(%) \nNumber of \nEquity Shares \nPercentage of \ntotal \nshareholding \n(%) \n1. \n Hari Shanker Khemka^ \n19,719,250 \n17.96 \n[●] \n[●] \n2. \n Aditya Khemka^ \n61,114,950 \n55.66 \n[●] \n[●] \n3. \n Ananmay Khemka \n925,400 \n0.84 \n[●] \n[●] \n4. \n Rishi Khemka^ \n14,716,749 \n13.40 \n[●] \n[●] \nTotal \n96,476,349 \n87.86 \n[●] \n[●] \n*Subject to finalisation of Basis of Allotment. \n^Prior to the filing of the Red Herring Prospectus with the RoC, our individual Promoters, Hari Shanker Khemka, Aditya Khemka and \nRishi Khemka, will transfer 19,719,150 Equity Shares of face value of ₹1 each to Hari Khemka Business Family Trust, 100 Equity \nShares of face value of ₹1 each to Aditya Khemka Business Family Trust and 100 Equity Shares of face value of ₹1 each to ARK \nBusiness Prosperity Trust, respectively. \n \nB. \nThe sub-section titled “– Details of Shareholding of our Promoters and members of the Promoter Group in \nthe Company – (iii) Build-up of the Promoters’ shareholding in our Company” beginning on page 105 of \nthe Draft Red Herring Prospectus stands replaced with the following: \n \n(iii) Build-up of the Promoters’ shareholding in our Company  \n \nThe build-up of the Equity Shareholding of our Promoters since the incorporation of our Company is set \nforth in the table below: \n \nDate of Allotment / \nTransfer / \nTransmission \nNature of transaction \nNumber of \nequity shares \nFace \nvalue per \nequity \nshare (₹) \nIssue \nPrice / \nTransfer \nPrice per \nequity \nshare (₹) \nPercentage \nof pre-Offer \nequity share \ncapital (%)  \nPercentage \nof post-Offer \nequity share \ncapital (%) \n(A) Hari Shanker Khemka \nMarch 27, 1995 \nInitial subscription to the \nMOA \n10 \n10.00 \n10.00 \nNegligible \n[●] \nMarch 30, 1998 \nFurther issue \n940 \n10.00 \n10.00 \n0.01 \n[●] \nJanuary 24, 2001 \nFurther issue \n20,000 \n10.00 \n10.00 \n0.18 \n[●] \nMarch 31, 2007 \nRights issue \n20,576 \n10.00 \n10.00 \n0.19 \n[●] \nNovember 30, 2009 10,618 equity shares from \nParmanand Khemka and \n719 equity shares from \nAditya Khemka  \n11,337 \n10.00 \n10.00 \n0.10 \n[●] \nDecember 14, 2009 Preferential allotment \n200,000 \n10.00 \n10.00 \n1.82 \n[●] \nAugust 29, 2013 \nTransfer of 97,120 equity \nshares \nfrom \nAnand \nKumar Khemka HUF and \n125,000 \n10.00 \n10.00 \n1.14 \n[●] \n",
        "tables": [],
        "key_findings": "The sub-section titled “– Details of Shareholding of our Promoters and members of the Promoter Group in the Company – (i) Equity shareholding of thepromoters” beginning on page 104 of the Draft Red Herring Prospectus stands replaced. As on the date of this Addendum, our Promoter collectively hold 96,476,349 Equity Shares of face value of ₹1 each. “Build-up of the Promoters’ shareholding in our Company” beginning on page 105 of the Draft Red Herring Prospectus stands replaced with the following. The build-up. of the Equity Shareholding of our Promoters since the incorporation of our. Company is set forth in the table below."
    },
    {
        "section_number": 8,
        "chapter_name": "Chapter 8",
        "company_name": "Unknown",
        "full_text": " \n7 \nDate of Allotment / \nTransfer / \nTransmission \nNature of transaction \nNumber of \nequity shares \nFace \nvalue per \nequity \nshare (₹) \nIssue \nPrice / \nTransfer \nPrice per \nequity \nshare (₹) \nPercentage \nof pre-Offer \nequity share \ncapital (%)  \nPercentage \nof post-Offer \nequity share \ncapital (%) \n27,880 equity shares from \nAnand Kumar Khemka  \nJuly 28, 2014 \nTransfer from Surendra \nKumar Khemka  \n375,000 \n10.00 \n10.00 \n3.42 \n[●] \nDecember 18, 2014 Transfer \nof \n163,807 \nequity shares from Prabha \nKhemka, 135,630 equity \nshares \nfrom \nGovind \nKumar Khemka HUF, \n75,563 equity shares from \nGovind Kumar Khemka, \n250,000 \nequity \nshares \nfrom Gaurav Khemka and \n250,000 \nequity \nshares \nfrom Raghav Khemka  \n875,000 \n10.00 \n10.00 \n7.97 \n[●] \nAugust 28, 2015 \nTransfer to Rishi Khemka  \n(375,000) \n10.00 \n10.00 \n(3.42) \n[●] \nTransfer \nto \nAdtiya \nKhemka \n(375,000) \n10.00 \n10.00 \n(3.42) \n[●] \nJanuary 15, 2020*  \nTransmission \nfrom \nUrmila Khemka \n103,104 \n10.00 \nN.A. \n0.94 \n[●] \nJanuary 21, 2020 \nGift to Ananmay Khemka  \n(10) \n10.00 \nN.A. \nNegligible \n[●] \nMarch 1, 2023 \nBuy-back \n(176,572) \n10.00 \n1,443.00 \n(1.61) \n[●] \nMarch 24, 2023 \nGift to Aditya Khemka  \n(410,000) \n10.00 \nN.A. \n(3.73) \n[●] \nEquity shares of our Company of face value of ₹10 each was sub-divided to 10 Equity Shares of face value of ₹1 \neach, pursuant to the resolution passed by our Shareholders on June 17, 2024. \nJune 17, 2024 \nBonus issue in the ratio of \n4:1 \n15,775,400 \n1.00 \nN.A. \n14.37 \n[●] \nSub-total (A)  \n19,719,250  \n \n17.96 \n[●] \n(B) Aditya Khemka \nMarch 27, 1995 \nInitial subscription to the \nMOA  \n10 \n10.00 \n10.00 \nNegligible \n[●] \nMarch 30, 1998 \nFurther issue  \n90 \n10.00 \n10.00 \nNegligible \n[●] \nJanuary 24, 2001 \nFurther issue \n85,000 \n10.00 \n10.00 \n0.77 \n[●] \nNovember 28, 2006 Transfer \nfrom \nAditya \nInfosolutions \nPrivate \nLimited  \n25,000 \n10.00 \n10.00 \n0.23 \n[●] \nMarch 31, 2007 \nRights issue \n10,288 \n10.00 \n10.00 \n0.09 \n[●] \nNovember 15, 2008 Transfer \nfrom \nPooja \nKhemka \n8,500 \n10.00 \n10.00 \n0.08 \n[●] \nMarch 31, 2009 \nPreferential allotment \n110,000 \n10.00 \n10.00 \n1.00 \n[●] \nNovember 30, 2009 Transfer to Hari Shanker \nKhemka  \n(719) \n10.00 \n10.00 \n(0.01) \n[●] \nAugust 29, 2013 \nTransfer of 22,716 equity \nshares \nfrom \nAruna \nKhemka \nand \n102,284 \nequity shares from Anand \nKumar Khemka \n125,000 \n10.00 \n10.00 \n1.14 \n[●] \nAugust 28, 2015 \nTransfer \nfrom \nHari \nShanker Khemka  \n375,000 \n10.00 \n10.00 \n3.42 \n[●] \nMarch 1, 2023 \nBuy-back \n(132,870) \n10.00 \n1,443.00 \n(1.21) \n[●] \nMarch 24, 2023 \nGift of 410,000 equity \nshares from Hari Shanker \nKhemka \nand \n207,000 \nequity shares from Rishi \nKhemka  \n617,000 \n10.00 \nN.A. \n5.62 \n[●] \n",
        "tables": [],
        "key_findings": "27,880 equity shares from Anand Kumar Khemka July 28, 2014 Transfer from Surendra Kumar Kemka 375,000 10.00 10.000 3.42 [●] December 18, 2014. Transfer of 163,807 equity shares. from Prabha KhemKA, 135,630 equity sharesfrom Govind Kumar K Hemka HUF, 75,563 equity shares, from Govind. Kumar. Sub-total (A) 19,719,250 17.96 [ ●] (B) Aditya Khemkas March 27, 2024 Bonus issue in the ratio of 4:1 15,775,400 1.00 N.A. 14.37. The company has made the following share transfers since 1995. The shares are subject to a minimum subscription of 10.00 per share. The company has the following rights:"
    },
    {
        "section_number": 9,
        "chapter_name": "Chapter 9",
        "company_name": "Unknown",
        "full_text": " \n8 \nDate of Allotment / \nTransfer / \nTransmission \nNature of transaction \nNumber of \nequity shares \nFace \nvalue per \nequity \nshare (₹) \nIssue \nPrice / \nTransfer \nPrice per \nequity \nshare (₹) \nPercentage \nof pre-Offer \nequity share \ncapital (%)  \nPercentage \nof post-Offer \nequity share \ncapital (%) \nEquity shares of our Company of face value of ₹10 each was sub-divided to 10 Equity Shares of face value of ₹1 \neach, pursuant to the resolution passed by our Shareholders on June 17, 2024 \nJune 17, 2024 \nBonus issue in the ratio of \n4:1 \n48,891,960 \n1.00 \nN.A. \n44.53 \n[●] \nSub-total (B)  \n61,114,950 \n \n55.66 \n[●] \n(C) Ananmay Khemka \nJanuary 21, 2020 \nGift from Hari Shanker \nKhemka \n10 \n10.00 \nN.A. \nNegligible \n[●] \nMarch 1, 2023 \nBuy-back \n(2) \n10.00 \n1,443.00 \nNegligible \n[●] \nMarch 24, 2023 \nGift from Rishi Khemka \n18,500 \n10.00 \nN.A. \n0.17 \n \nEquity shares of our Company of face value of ₹10 each was sub-divided to 10 Equity Shares of face value of ₹1 \neach, pursuant to the resolution passed by our Shareholders on June 17, 2024 \nJune 17, 2024 \nBonus issue in the ratio of \n4:1 \n740,320 \n1.00 \nN.A. \n0.67 \n[●] \nSub-total (C) \n925,400 \n \n0.84 \n[●] \n(D) Rishi Khemka \nMarch 30, 1998 \nFurther issue \n100 \n10.00 \n10.00 \nNegligible \n[●] \nJanuary 24, 2001 \nFurther issue \n85,000 \n10.00 \n10.00 \n0.77 \n[●] \nNovember 28, 2006 Transfer \nfrom \nAditya \nInfosolutions \nPrivate \nLimited  \n25,000 \n10.00 \n10.00 \n0.23 \n[●] \nMarch 31, 2007 \nRights issue \n11,317 \n10.00 \n10.00 \n0.10 \n[●] \nNovember 15, 2008 Transfer \nfrom \nPooja \nKhemka \n8,475 \n10.00 \n10.00 \n0.08 \n[●] \nDecember 14, 2009 Preferential allotment \n120,108 \n10.00 \n10.00 \n1.09 \n[●] \nAugust 29, 2013 \nTransfer \nof \n117,284 \nequity shares of face \nvalue of ₹10 each from \nAruna Khemka and 7,716 \nequity shares of face \nvalue of ₹10 each from \nVikramaditya Khemka.  \n125,000 \n10.00 \n10.00 \n1.14 \n[●] \nAugust 28, 2015 \nTransfer \nfrom \nHari \nShanker Khemka  \n375,000 \n10.00 \n10.00 \n3.42 \n[●] \nMarch 1, 2023 \nBuy-back \n(135,000) \n10.00 \n1,443.00 \n(1.23) \n[●] \nMarch 24, 2023 \nGift to Aditya Khemka  \n(207,000) \n10.00 \n10.00 \n(1.89) \n[●] \nGift to Anamay Khemka  \n(18,500) \n10.00 \nN.A. \n(0.17) \n[●] \nEach equity share of our Company of face value of ₹10 was sub-divided to 10 Equity Shares of face value of ₹1 each, \npursuant to the resolution passed by our Shareholders on June 17, 2024 \nJune 17, 2024 \nBonus issue in the ratio of \n4:1 \n15,580,000 \n1.00 \nN.A. \n14.19 \n[●] \nSeptember 26, \n2024 \nGift to Ruchi Khemka \n(4,758,251) \n1.00 \nN.A. \n4.33 \n[●] \nSub-total (D) \n14,716,749 \n \n13.40 \n[●] \nGrand Total (A)+(B)+(C)+(D) \n96,476,349 \n \n87.86 \n[●] \n*Urmila Khemka (wife of Hari Shanker Khemka) passed away in Fiscal 2020. A formal request to the registrar and transfer agent for \ntransmission of the equity shares of Lt. Urmila Khemka in favour of her nominee, Hari Shanker Khemka was made on January 22, \n2020, however the registrar and transfer agent confirmed the credit of the equity shares to Hari Shanker Khemka only on September \n14, 2020. \nNote: Our Company has been unable to trace the share transfer forms in relation to transfers made prior to or during 2013. Accordingly, \nreliance has been placed on the Company’s annual returns, the register of members, the register of transfers and board resolutions \nnoting the transfers, where available. For further details, see “Risk Factors – Internal Risks Factors – We are unable to trace some of \nour historical records including forms filed with the Registrar of Companies” on page 46 of the Draft Red Herring Prospectus. \n \nC. \nThe sub-section titled “– Details of Shareholding of our Promoters and members of the Promoter Group in \nthe Company – (vi) Equity Shareholding of the members of the Promoter Group” beginning on page 106 of \n",
        "tables": [],
        "key_findings": " Equity shares of our Company of face value of ₹10 each was sub-divided to 10 Equity Shares of facevalue of ⁹1 each, pursuant to the resolution passed by our Shareholders on June 17, 2024. Bonus issue in the ratio of 4:1 48,891,960 1.00 N.A. 44.53 [●] Sub-total (B) 61,114,950 55.66 [●) (C) Ananmay Khemka January 21, 2020 Gift from Hari Shanker KhemKA 10 10.00 0.77 [●]. November 28, 2006 Transfer from Aditya Infosolutions Private Limited 25,000 10.000 0. The Company has been unable to trace the share transfer forms in relation to transfers made prior to or during 2013. A formal request to the registrar and transfer agent for transmission of the equity shares of Lt. Urmila Khemka in favour of her nominee, Hari Shanker KhemKA was made on January 22, 2020. The registrar confirmed the credit of the shares to Hari on September 14, 2020, however the Company has not been able to trace these transfer forms. For further details, see “Risk Factors – Internal Risks Factors – We are unable to trace some of our historical records including forms filed with the Registrar of Companies” on page 46 of the Draft Red Herring Prospectus. The sub-section titled “– Details of Shareholding of our Promoters and members of the Promoter Group in the"
    },
    {
        "section_number": 10,
        "chapter_name": "Chapter 10",
        "company_name": "Unknown",
        "full_text": " \n9 \nthe Draft Red Herring Prospectus stands replaced with the following: \n \n(vi) Equity Shareholding of the members of the Promoter Group \n \nAs on the date of this Addendum, the members of our Promoter Group (other than our Promoters) \ncollectively hold 6,023,651 Equity Shares of face value of ₹1 each, equivalent to 5.49% of the issued, \nsubscribed and paid-up Equity Share capital of our Company, as set forth in the table below: \n \nS. No. Name of the Shareholder \nPre-Offer Equity Share Capital \nPost-Offer Equity Share Capital^ \nNumber of \nEquity Shares of \nface value of ₹1 \neach \nPercentage of \ntotal \nshareholding \n(%)  \nNumber of \nEquity Shares of \nface value of ₹1 \neach \nPercentage of \ntotal \nshareholding \n(%) \n1. \n Hari \nShankar \nKhemka \n(HUF)* \n780,350 \n0.71 \n[●] \n[●] \n2. \n Shradha Khemka* \n464,000 \n0.42 \n[●] \n[●] \n3. \n Aditya Khemka (HUF)* \n21,050 \n0.02 \n[●] \n[●] \n4. \n Ruchi Khemka \n4,758,251 \n4.33 \n[●] \n[●] \nTotal \n6,023,651 \n5.49 \n[●] \n[●] \n*Also Promoter Group Selling Shareholders. \n^Subject to finalisation of Basis of Allotment. \n \nD. \nThe sub-section titled “– Details of Shareholding of our Promoters and members of the Promoter Group in \nthe Company – (vii) Except as disclosed in – “Build-up of the Promoters’ shareholding in our Company” \non page 105 and except as disclosed below, there has been no acquisition of securities through secondary \ntransactions by the members of the Promoter Group (apart from our Promoters) and the Selling \nShareholders, as on the date of this Draft Red Herring Prospectus:” beginning on page 107 of the Draft Red \nHerring Prospectus stands replaced with the following: \nExcept as disclosed in “– Build-up of the Promoters’ shareholding in our Company” on page 6 of this \nAddendum and except as disclosed below, there has been no acquisition of securities through secondary \ntransactions by the members of the Promoter Group (apart from our Promoters) and the Selling Shareholders, \nas on the date of this Addendum: \n \nDate of \nAllotment / \nTransfer / \nTransmission \nName of transferor \nName of transferee \nNumber of \nequity \nshares \ntransferred \nFace value \nper equity \nshare (₹) \nTransfer \nprice per \nequity share \n(₹) \nAditya Infosolutions Private Limited \nOctober 25, 2004 Anand \nKumar \nKhemka \n(HUF) \nAditya \nInfosolutions \nPrivate Limited \n100,000 \n10.00 \n10.00 \nSurendra Kumar Khemka (HUF) \nNovember 28, \n2006 \nAditya Infosolutions Private \nLimited \nSurendra Kumar Khemka \nHUF \n50,000 \n10.00 \n10.00 \nAnand Kumar Khemka \nNovember 28, \n2006 \nAditya Infosolutions Private \nLimited \nAnand Kumar Khemka \n50,000 \n10.00 \n10.00 \nSurendra Kumar Khemka \nNovember 30, \n2009 \nSurendra Kumar Khemka \n(HUF) \nSurendra Kumar Khemka \n50,000 \n10.00 \n10.00 \nAditya Infosolutions Private \nLimited \nSurendra Kumar Khemka \n45,000 \n10.00 \n10.00 \nParmanand Khemka (HUF) Surendra Kumar Khemka \n14,403 \n10.00 \n10.00 \nParmanand Khemka \nSurendra Kumar Khemka \n6,357 \n10.00 \n10.00 \nJuly 20, 2014 \n \nSurendra Kumar Khemka \n(HUF) \nSurendra Kumar Khemka \n14,403 \n10.00 \n10.00 \nIndu Khemka \nSurendra Kumar Khemka \n121,816 \n10.00 \n10.00 \nRaghav Khemka \nNovember 30, \n2009 \nAditya Infosolutions Private \nLimited \nRaghav Khemka \n200,000 \n10.00 \n10.00 \n",
        "tables": [],
        "key_findings": "The members of our Promoter Group (other than our Promoters) collectively hold 6,023,651 Equity Shares of face value of ₹1 each, equivalent to 5.49% of the issued, subscribed and paid-up Equity Share capital of our Company. The sub-section titled “– Details of Shareholding’ beginning on page 107 of the Draft Red Herring Prospectus stands replaced with the following: “Build-up of the Promoters’ shareholding in our Company” on page 105. As on the date of this Addendum: Date of Allotment / Transfer / Transmission Name of transferor Name of transferee Number of equity shares transferred Face value per equity share (₹) Transfer price per equity shares (≹) Aditya Infosolutions Private Limited October 25, 2004 Anand Kumar Khemka (HUF) Surendra Kumar Khemka HUF 50,000."
    },
    {
        "section_number": 11,
        "chapter_name": "Chapter 11",
        "company_name": "Unknown",
        "full_text": " \n10 \nNote: Our Company has been unable to trace the share transfer forms in relation to transfers made prior to or during 2013. Accordingly, \nreliance has been placed on the Company’s annual returns, the register of members, the register of transfers and board resolutions \nnoting the transfers, where available. For further details, see “Risk Factors – Internal Risks Factors – We are unable to trace some of \nour historical records including forms filed with the Registrar of Companies” on page 46 of the Draft Red Herring Prospectus. \n \nE. \nThe sub-section titled “– Details of Shareholding of our Promoters and members of the Promoter Group in \nthe Company – (x) Details of minimum Promoters’ contribution locked in for 18 months or any other period \nas may be prescribed under applicable law” beginning on page 108 of the Draft Red Herring Prospectus \nstands replaced with the following: \n \nPursuant to Regulations 14 and 16 of the SEBI ICDR Regulations, an aggregate of 20% of the fully diluted \npost-Offer Equity Share capital of our Company held by our Promoters shall be considered as minimum \npromoters’ contribution and locked-in for a period of 18 months or any other period as may be prescribed \nunder applicable law, from the date of Allotment (“Promoter’s Contribution”). Our Promoters’ \nshareholding in excess of 20% shall be locked in for a period of six months from the date of the Allotment. \nAs on the date of this Addendum, our Promoters hold 96,476,349 Equity Shares of face value of ₹1 each, \nconstituting 87.86% of our Company’s issued, subscribed and paid-up Equity Share capital, of which [●] \nEquity Shares of face value of ₹1 each, are eligible for Promoters’ Contribution.  \n \nOur Promoters have given consent, to include such number of Equity Shares held by them, in aggregate, as \nmay constitute 20% of the fully diluted post-Offer Equity Share capital of our Company as Promoter’s \nContribution. Our Promoters have agreed not to dispose, sell, transfer, charge, pledge or otherwise encumber \nin any manner the Promoters’ Contribution from the date of this Draft Red Herring Prospectus, until the \nexpiry of the lock-in period specified above, or for such other time as required under SEBI ICDR \nRegulations, except as may be permitted, in accordance with the SEBI ICDR Regulations.  \n \nThe details of Equity Shares held by our Promoters, which will be locked-in for minimum Promoters’ \nContribution for a period of 18 months, from the date of Allotment as Promoters’ Contribution are as \nprovided below: \n \nName of \nthe \nPromoter \nNumber \nof Equity \nShares of \nface \nvalue of \n₹1 each \nlocked-\nin** \nDate of \nallotment/ \ntransfer# \nFace \nvalue \nper \nEquity \nShare \n(₹) \nIssue/ \nAcquisition \nprice per \nEquity \nShare (₹) \nNature of \nallotment \nPercentage \nof the post-\nOffer paid-\nup Equity \nShare \ncapital \nDate up to \nwhich the \nEquity \nShares are \nsubject to \nlock-in \n[●] \n[●] \n[●] \n[●] \n[●] \n[●] \n[●] \n[●] \n[●] \n[●] \n[●] \n[●] \n[●] \n[●] \n[●] \n[●] \nTotal \n[●] \n[●] \n[●] \n[●] \n[●] \n[●] \n[●] \nNote: To be updated at the Prospectus stage. \n#Equity Shares were fully paid-up on the date of allotment / acquisition. \n**Subject to finalisation of Basis of Allotment. \n \n \n \n \n",
        "tables": [],
        "key_findings": "The Company has been unable to trace the share transfer forms in relation to transfers made prior to or during 2013. The sub-section titled “– Details of Shareholding of our Promoters and members of the Promoter Group in the Company – (x) Details of minimum Promoters’ contribution locked in for 18 months or any other period as may be prescribed under applicable law” beginning on page 108 of the Draft Red Herring Prospectus stands replaced. The details of Equity Shares held by our Promoters, which will be locked-in for minimum Promoters’ Contribution for a period of 18 months, are as provided below."
    },
    {
        "section_number": 12,
        "chapter_name": "Chapter 12",
        "company_name": "Unknown",
        "full_text": " \n11 \n \nF. \nThe sub-section titled “– Shareholding pattern of our Company” beginning on page 110 of the Draft Red Herring Prospectus stands replaced with the following: \n \nShareholding Pattern of our Company  \n \nThe table below presents the shareholding pattern of our Company as on the date of this Addendum: \n \nCateg\nory \n(I) \nCategor\ny of \nShareh\nolder \n(II) \nNumber \nof \nShareho\nlders \n(III) \nNumber of \nfully paid up \nEquity Shares \nheld \n(IV) \nNum\nber \nof \nPartl\ny \npaid-\nup \nEqui\nty \nShar\nes \nheld \n(V) \nNumb\ner of \nshares \nunderl\nying \nDeposi\ntory \nReceip\nts \n(VI) \nTotal number \nof Equity \nShares held \n(VII) \n=(IV)+(V)+ \n(VI) \nShareho\nlding as \na % of \ntotal \nnumber \nof shares \n(calculat\ned as \nper \nSCRR, \n1957) \nAs a % \nof \n(A+B+C\n2) (VIII) \nNumber of Voting Rights held in each class \nof securities \n(IX) \nNumber \nof \nEquity \nShares \nUnderly\ning \nOutstan\nding \nconverti\nble \nsecuriti\nes \n(includi\nng \nWarran\nts) \n(X) \nShareho\nlding as \na % \nassumin\ng full \nconversi\non of \nconverti\nble \nsecuritie\ns (as a \npercenta\nge of \ndiluted \nEquity \nShare \ncapital) \n(XI)= \n(VII)+(X\n) As a % \nof \n(A+B+C\n2) \nNumber \nof Locked \nin Equity \nShares \n(XII) \nNumber \nof Equity \nShares \npledged or \notherwise \nencumber\ned \n(XIII) \nNumber of \nEquity Shares \nheld in \ndematerialize\nd form \n(XIV) \nNumber of voting rights \nTotal \nas a % \nof \n(A+B+ \nC) \nNum\nber \n(a) \nAs a \n% \nof \ntota\nl \nEqu\nity \nSha\nres \nheld \n(b) \nNum\nber \n(a) \nAs a \n% \nof \ntota\nl \nEqu\nity \nSha\nres \nheld \n(b) \nClass e.g.: \nEquity Shares \nClass \ne.g.: \nOther\ns \nTotal \n(A) Promote\nr \nand \nPromote\nr Group \n8 \n102,500,000 \n- \n- \n102,500,000 \n93.35 \n102,500,000 \n- 102,500,000 \n93.35 \n- \n93.35 \n- \n- \n- \n- \n102,500,000 \n(B) Public \n1 \n7,305,805 \n- \n- \n7,305,805 \n6.65 \n7,305,805 \n- \n7,305,805 \n6.65 \n- \n6.65 \n- \n- \n- \n- \n7,305,805 \n(C) Non \nPromote\nr- \nNon \nPublic \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n(C)(1) Shares \nunderlyi\nng DRs \n- \n- \n- \n- \n \n- \n- \n- \n \n \n \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n",
        "tables": [],
        "key_findings": "The sub-section titled “– Shareholding pattern of our Company” beginning on page 110 of the Draft Red Herring Prospectus stands replaced with the following. The table below presents the shareholding patterns of our company as on the date of this Addendum. 7,305,805 - 7,305,.805 - 6.65 - 6,65 - - - 8,000,000 (C) 6,500,000 - 6,.5 million - 5.5 million ("
    },
    {
        "section_number": 13,
        "chapter_name": "Chapter 13",
        "company_name": "Unknown",
        "full_text": " \n12 \n \nCateg\nory \n(I) \nCategor\ny of \nShareh\nolder \n(II) \nNumber \nof \nShareho\nlders \n(III) \nNumber of \nfully paid up \nEquity Shares \nheld \n(IV) \nNum\nber \nof \nPartl\ny \npaid-\nup \nEqui\nty \nShar\nes \nheld \n(V) \nNumb\ner of \nshares \nunderl\nying \nDeposi\ntory \nReceip\nts \n(VI) \nTotal number \nof Equity \nShares held \n(VII) \n=(IV)+(V)+ \n(VI) \nShareho\nlding as \na % of \ntotal \nnumber \nof shares \n(calculat\ned as \nper \nSCRR, \n1957) \nAs a % \nof \n(A+B+C\n2) (VIII) \nNumber of Voting Rights held in each class \nof securities \n(IX) \nNumber \nof \nEquity \nShares \nUnderly\ning \nOutstan\nding \nconverti\nble \nsecuriti\nes \n(includi\nng \nWarran\nts) \n(X) \nShareho\nlding as \na % \nassumin\ng full \nconversi\non of \nconverti\nble \nsecuritie\ns (as a \npercenta\nge of \ndiluted \nEquity \nShare \ncapital) \n(XI)= \n(VII)+(X\n) As a % \nof \n(A+B+C\n2) \nNumber \nof Locked \nin Equity \nShares \n(XII) \nNumber \nof Equity \nShares \npledged or \notherwise \nencumber\ned \n(XIII) \nNumber of \nEquity Shares \nheld in \ndematerialize\nd form \n(XIV) \nNumber of voting rights \nTotal \nas a % \nof \n(A+B+ \nC) \nNum\nber \n(a) \nAs a \n% \nof \ntota\nl \nEqu\nity \nSha\nres \nheld \n(b) \nNum\nber \n(a) \nAs a \n% \nof \ntota\nl \nEqu\nity \nSha\nres \nheld \n(b) \nClass e.g.: \nEquity Shares \nClass \ne.g.: \nOther\ns \nTotal \n(C)(2) Shares \nheld by \nEmploy\nee \nTrusts \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n- \n \nTotal \n(A)+(B)\n+(C) \n9 \n109,805,805 \n- \n- \n109,805,805 \n100 \n109,805,805 \n- 109,805,805 \n100 \n- \n100 \n- \n- \n- \n- \n109,805,805 \n \n \n",
        "tables": [],
        "key_findings": "12 Categ ory (I) Categor y of Shareh older (II) Number of fully paid up Equity Shares held (IV) Num ber of Partl y paid- up Equi ty Shar es held (V) Numb er of shares underl ying Deposi tory Receip ts (VI) Total number of Equity shares held (VII) =(IV)+(V)+ (VI), Shareho lding as a % of total number of shares (calculat ed as per SCRR, 1957) (VIII) number of Voting Rights held in each class of securities (IX) Number Of Equity Shares Underly ing Outstan ding converti ble securiti es (includi"
    },
    {
        "section_number": 14,
        "chapter_name": "Chapter 14",
        "company_name": "Unknown",
        "full_text": " \n13 \n \nOBJECTS OF THE OFFER \n \nA. The sub-section titled “– Offer for Sale” beginning on page 116 of the Draft Red Herring Prospectus stands \nreplaced with the following:  \n \nOffer for Sale \n \nEach of the Selling Shareholders has, severally and not jointly, consented and/or authorised for inclusion of \ntheir portion of the Offered Shares as part of the Offer for Sale, as set out below:  \n \nName \nType \nAggregate amount of Offer \nfor Sale \nDate of Selling \nShareholders’ consent \nletter \nAditya Khemka \nPromoter \nUp to ₹5,240.04 million \nSeptember 27, 2024 \nAnanmay Khemka \nPromoter  \nUp to ₹123.16 million \nSeptember 27, 2024 \nRishi Khemka \nPromoter \nUp to ₹2,000.00 million \nSeptember 27, 2024 \nHari Shankar Khemka \n(HUF) \nPromoter Group  \nUp to ₹426.40 million \nSeptember 27, 2024 \nShradha Khemka \nPromoter Group  \nUp to ₹198.90 million \nSeptember 27, 2024 \nAditya Khemka (HUF) \nPromoter Group  \nUp to ₹11.50 million \nSeptember 27, 2024 \n \nEach of the Selling Shareholders will be entitled to its respective portion of the proceeds of the Offer for Sale \nafter deducting agreed proportion of the Offer expenses and relevant taxes thereon. Our Company will not \nreceive any proceeds from the Offer for Sale by the Selling Shareholders and the proceeds from the Offer for \nSale will not form part of the Net Proceeds. For further details, see “– Offer expenses” on page 121 of the Draft \nRed Herring Prospectus. \n \n \n \n \n",
        "tables": [],
        "key_findings": "The sub-section titled “– Offer for Sale” beginning on page 116 of the Draft Red Herring Prospectus stands replaced with the following. Each of the Selling Shareholders has, severally and not jointly, consented and/or authorised for inclusion of their portion of the Offered Shares."
    },
    {
        "section_number": 15,
        "chapter_name": "Chapter 15",
        "company_name": "Unknown",
        "full_text": " \n14 \n \nHISTORY AND CERTAIN CORPORATE MATTERS \n \nA. The sub-section titled “– Guarantees given by our Promoter Selling Shareholders” beginning on page 256 \nof the Draft Red Herring Prospectus stands replaced with the following: \n \nGuarantees given by our Promoter Selling Shareholders  \n \nOther than as disclosed below, as on the date of this Addendum, the Promoter Selling Shareholders have not \ngiven any guarantees to third parties: \n \nS. \nNo. \nGuarantee issued by \nGuarantee \nissued in \nfavour of \nBorrower \nGuarantee \namount  \n(₹ in million) \nType of facility \n1. \nHari Shanker Khemka*, \nAditya Khemka and Rishi \nKhemka \nYes \nBank \nLimited \nAditya \nInfotech \nLimited \n1,000.00 \nFund based and non-\nfund-based facilities \n2. \nHari Shanker Khemka*, \nAditya Khemka and Rishi \nKhemka \nTamilnad \nMercantile \nBank Limited \nAditya \nInfotech \nLimited \n2,550.00 \nFund based and non-\nfund-based facilities \n3. \nHari Shanker Khemka*, \nAditya \nKhemka \nRishi \nKhemka \nICICI \nBank \nLimited \nAditya \nInfotech \nLimited \n500.00 \nWorking \ncapital \nfacilities \n4. \nHari Shanker Khemka*, \nAditya Khemka and Rishi \nKhemka \nHDFC Bank \nLimited \nAditya \nInfotech \nLimited \n1,000.00 \nFund based and non-\nfund-based facilities \n5. \nAditya Khemka \nAxis \nBank \nLimited \nAditya \nInfotech \nLimited \n860.00 \nFund based and non-\nfund-based facilities \n6. \nHari Shanker Khemka* \nand Rishi Khemka \nYes Bank \nLimited \nARK Infosolutions \nPrivate Limited \n250.00 \nFund based and non-\nfund-based facilities \n7. \nHari Shanker Khemka* \nand Rishi Khemka \nICICI Bank \nLimited \nARK Infosolutions \nPrivate Limited \n91.10 \nHome loan for property \nacquired \nby \nARK \nInfosolutions \nPrivate \nLimited \n8. \nHari Shanker Khemka*, \nAditya Khemka and Rishi \nKhemka \nPunjab \nNational \nBank Limited \nARK Infosolutions \nPrivate Limited \n10.90 \nVehicle loan \n*Our individual Promoter, Hari Shanker Khemka is not offering his shares in the Offer for Sale. \n \nThe guarantees set out above have been issued as security in connection with the facilities availed by our \nCompany. Pursuant to the terms of the guarantees, the obligations of our Promoter Selling Shareholders \ninclude repayment of the guaranteed sum in case of default by the respective borrowers. The financial \nimplications in case of default by the borrower are that the lender would be entitled to invoke the guarantees \nto the extent of the outstanding loan amount, together with any interests, costs or charges due to the respective \nlenders. The guarantees are effective for a period until the underlying loan is repaid in full by the respective \nborrower. Any default or failure by our Company or the relevant borrower entity to repay the loans in a \ntimely manner, or at all, could trigger repayment obligations on the part of our Promoter Selling \nShareholders. No consideration has been paid or is payable to our Promoter Selling Shareholders for \nproviding these guarantees. For details of the security in connection with the secured borrowings of our \nCompany, see “Financial Indebtedness – Principal terms of the borrowings availed by our Company – \nSecurity” on page 391 of the Draft Red Herring Prospectus.  \n \nB. The sub-section titled “– Other material agreements” beginning on page 256 of the Draft Red Herring \nProspectus stands replaced with the following:  \n \nOther material agreements  \n \nExcept as disclosed below, our Company has not entered into any subsisting material agreements and there \nare no other agreements / arrangements entered into by our Company or clauses / covenants applicable to \nour Company, which are material and are required to be disclosed, or the non-disclosure of which may have \n",
        "tables": [],
        "key_findings": "The sub-section titled “– Guarantees given by our Promoter Selling Shareholders” beginning on page 256 of the Draft Red Herring Prospectus stands replaced with the following. Other than as disclosed below, as on the date of this Addendum, the Promoter selling Shareholders have not given any guarantees to third parties. The guarantees set out above have been issued as security in connection with the facilities availed by our Company. Pursuant to the terms of the guarantees, the obligations of our Promoter Selling Shareholders include repayment of the guaranteed sum in case of default by the respective borrowers."
    },
    {
        "section_number": 16,
        "chapter_name": "Chapter 16",
        "company_name": "Unknown",
        "full_text": " \n15 \n \na bearing on the investment decision of prospective investors in the Offer, including with strategic partners, \njoint venture partners and/or financial partners, other than in the ordinary course of business: \n \nAgreement dated September 27, 2024 (“Inter-se Agreement”), entered amongst Aditya Khemka, Shradha \nKhemka, Ananmay Khemka, Aditya Khemka (HUF), Hari Khemka Business Family Trust, Aditya \nKhemka Business Family Trust, Hari Shanker Khemka, Hari Shankar Khemka (HUF), Rishi Khemka, \nRuchi Khemka and ARK Business Prosperity Trust (collectively, “Parties”)  \n \nThe Parties have executed the Inter-se Agreement to record certain inter se rights and obligations of our \nCompany and other related matters, including, (i) appointment of Aditya Khemka as authorised \nrepresentative to exercise any and all rights to participate and vote on behalf of each of the other Parties; (ii) \nright of Aditya Khemka to nominate directors on the Board and on the board of subsidiary/ joint ventures in \nwhich our Company has a right to nominate board or directors, subject to certain conditions mentioned in \nthe Inter-se Agreement; (iii) certain transfer related rights, including tag-along rights with respect to Equity \nShares that are proposed to be transferred to third parties by either of the Parties from the date of listing of \nthe Equity Shares on the recognised Stock Exchange until the completion of the lock-in as defined in the \nInter-se Agreement; and (iv) an understanding between the parties in relation to any sale of shares until \nlisting.  \n \nIn terms of the Inter-se Agreement, our individual Promoters, Hari Shanker Khemka, Aditya Khemka and \nRishi Khemka will transfer 19,719,150 Equity Shares of face value of ₹1 each to Hari Khemka Business \nFamily Trust, transfer 100 Equity Shares of face value of ₹1 each to Aditya Khemka Business Family Trust \nand transfer 100 Equity Shares of face value of ₹1 each to ARK Business Prosperity Trust, respectively. \n \nOur Company is not a party to the Inter-se Agreement and the same shall terminate automatically upon either \nby way of the mutual written consent of Aditya Khemka and Rishi Khemka or when either Hari Shanker \nKhemka or certain of the other Parties cease to hold any Equity Shares in our Company.  \n \n \n \n \n",
        "tables": [],
        "key_findings": "The parties have executed the Inter-se Agreement to record certain inter se rights and obligations of our Company. Aditya Khemka can nominate directors on the Board and on the board of subsidiary/ joint ventures in which our Company has a right to nominate board. Our Company is not a party to the Inter-se Agreement and the same shall terminate automatically upon either by way of the mutual written consent of Aditya Khemka and Rishi Khem"
    },
    {
        "section_number": 17,
        "chapter_name": "Chapter 17",
        "company_name": "Unknown",
        "full_text": " \n16 \n \nSECTION V – ABOUT OUR COMPANY \n \nOUR PROMOTERS AND PROMOTER GROUP \n \nExcept to the disclosures which stands replaced pursuant to this Addendum in the “Our Promoters and \nPromoter Group” section beginning on page 280 of the Draft Red Herring Prospectus, all the other details \nforming part of the Draft Red Herring Prospectus in relation to the confirmations from the Promoters in the \n“Our Promoters and Promoter Group” section beginning on page 280 of the Draft Red Herring Prospectus \nshall be read in conjunction with this section.  \n \nThe Promoters of our Company are Hari Shanker Khemka, Aditya Khemka, Ananmay Khemka, Rishi Khemka \nand Hari Khemka Business Family Trust. As on the date of this Addendum, our Promoters collectively hold \n96,476,349 Equity Shares of face value of ₹1 each, representing 87.86% of the pre-Offer issued, subscribed \nand paid-up Equity Share capital of our Company. Pursuant to the Inter-se Agreement and prior to the filing \nof the Red Herring Prospectus with the RoC, our individual Promoters, Hari Shanker Khemka, Aditya \nKhemka and Rishi Khemka, will transfer 19,719,150 Equity Shares of face value of ₹1 each to Hari Khemka \nBusiness Family Trust, 100 Equity Shares of face value of ₹1 each to Aditya Khemka Business Family Trust \nand 100 Equity Shares of face value of ₹1 each to ARK Business Prosperity Trust, respectively. \n \nUpon completion of the aforesaid transfers, (i) Hari Shanker Khemka will hold 100 Equity Shares of face \nvalue of ₹1 each; (ii) Aditya Khemka will hold 61,114,850 Equity Shares of face value of ₹1 each; (iii) Rishi \nKhemka will hold 14,716,649 Equity Shares of face value of ₹1 each; and (iv) Hari Khemka Business Family \nTrust will hold 19,719,150 Equity Shares of face value of ₹1 each, representing, 0.00%, 55.66%, 13.40% \nand 17.96%, respectively, of the issued, subscribed and paid-up Equity Share capital of our Company. \n \nAccordingly, upon completion of such transfers, our Promoters collectively hold 96,476,149 of face value of \n₹1 each, representing 87.86% of the pre-Offer issued, subscribed and paid-up Equity Share capital of our \nCompany. \n \nFor details, see “Capital Structure – Details of Shareholding of our Promoters and members of the Promoter \nGroup in the Company – Equity Shareholding of the Promoters” beginning on page 6 of this Addendum.  \n \nA. \nThe sub-section titled “– Details of our Promoters” beginning on page 280 of the Draft Red Herring \nProspectus stands replaced with the following: \n \nDetails of our Promoters are as follows:  \n \nHari Shanker Khemka  \n \n \n \n \nHari Shanker Khemka, aged 71 years, is one of our Promoters and is also \nthe Chairman and Whole-time Director on our Board. For the complete \nprofile of Hari Shanker Khemka along with details of his date of birth, \npersonal address, educational qualifications, professional experience, \nposition / posts held in the past, directorships held, and business and \nfinancial activities, other directorships, other ventures and special \nachievements, see “Our Management – Board of Directors” on page 258 \nof the Draft Red Herring Prospectus. \n \nHis PAN is ‘AAEPK8265B’. \n \nAs on date of this Addendum, Hari Shanker Khemka holds 19,719,250 \nEquity Shares of face value of ₹1 each, representing 17.96% of the \nissued, subscribed and paid-up Equity Share capital of our Company. \nPursuant to the Inter-se Agreement, he will transfer 19,719,150 Equity \nShares of face value of ₹1 each to Hari Khemka Business Family Trust, \nprior to the filing of the Red Herring Prospectus with the RoC. Upon \ncompletion of the aforesaid transfer, he will hold 100 Equity Shares of \n",
        "tables": [],
        "key_findings": "Our Promoters collectively hold 96,476,349 Equity Shares of face value of ₹1 each, representing 87.86% of the pre-Offer issued, subscribed and paid-up Equity Share capital of our Company. Pursuant to the Inter-se Agreement and prior to the filing of the Red Herring Prospectus, our individual Promoters will transfer 19,719,150 Equity Shares. The sub-section titled “– Details of our Promoters” beginning on page 280 of the Draft Red Herring Prospectus stands replaced with the following: Details ofOur Promoters are as follows: Hari Shanker Khemka, aged 71 years, is one of ourpromoters and is also the Chairman and Whole-time Director on our Board. His PAN is ‘AAEPK8265B'"
    },
    {
        "section_number": 18,
        "chapter_name": "Chapter 18",
        "company_name": "Unknown",
        "full_text": " \n17 \n \nface value of ₹1 each, representing negligible shareholding of the issued, \nsubscribed and paid-up Equity Share capital of our Company. \n \nAditya Khemka \n \n \n \nAditya Khemka, aged 50 years, is one of our Promoters and is also the \nManaging Director on our Board. For the complete profile of Aditya \nKhemka along with details of his date of birth, personal address, \neducational qualifications, professional experience, position / posts \nheld in the past, directorships held, and business and financial activities, \nother directorships, other ventures and special achievements, see “Our \nManagement – Board of Directors” on page 258 of the Draft Red \nHerring Prospectus. \n \nHis PAN is ‘AAEPK1216E’. \n \nAs on date of this Addendum, Aditya Khemka holds 61,114,950 Equity \nShares of face value of ₹1 each, representing 55.66% of the issued, \nsubscribed and paid-up Equity Share capital of our Company. Pursuant \nto the Inter-se Agreement, he will transfer 100 Equity Shares of face \nvalue of ₹1 each to Aditya Khemka Business Family Trust, prior to the \nfiling of the Red Herring Prospectus with the RoC. Upon completion of \nthe aforesaid transfer, he will hold 61,114,850 Equity Shares of face \nvalue of ₹1 each, representing 55.66% of the issued, subscribed and \npaid-up Equity Share capital of our Company.  \n \nAnanmay Khemka \n \n \nAnanmay Khemka, aged 25 years, is one of our Promoters and is also \nthe Whole-time Director on our Board. For the complete profile of \nAnanmay Khemka along with details of his date of birth, personal \naddress, educational qualifications, professional experience, position / \nposts held in the past, directorships held, and business and financial \nactivities, other directorships, other ventures and special achievements, \nsee “Our Management – Board of Directors” on page 258 of the Draft \nRed Herring Prospectus. \n \nHis PAN is ‘GNVPK8581G’. \n \nAs on date of this Addendum, Ananmay Khemka holds 925,400 Equity \nShares of face value of ₹1 each, representing 0.84% of the issued, \nsubscribed and paid-up Equity Share capital of our Company. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
        "tables": [],
        "key_findings": "Aditya Khemka, aged 50 years, is one of our Promoters and is also the Managing Director on our Board. He holds 61,114,950 Equity Shares of face value of ₹1 each, representing 55.66% of the issued, subscribed and paid-up Equity Share capital of our Company. ₹1 each, representing 0.84% of the issued, subscribed and paid-up Equity Share capital of our Company."
    },
    {
        "section_number": 19,
        "chapter_name": "Chapter 19",
        "company_name": "Unknown",
        "full_text": " \n18 \n \nRishi Khemka \n \n \n \nRishi Khemka, aged 47 years, is one of our Promoters. \n \nDate of birth: December 25, 1976 \n \nAddress: Farm Number 2, Daisy Lane, DLF Chhatarpur Farm, South \nDelhi – 110 074, Delhi, India \n \nHis PAN is ‘AADPK4223E’. \n \nRishi Khemka has completed the examination of Chartered Institute of \nManagement Accountants. He has approximately 19 years of \nexperience in the value-added services sector. Further, he is also a \npromoter of ARK Infosolutions Private Limited. He is currently a \ndirector of ARK Infosolutions Private Limited, ARK Tech Innovation \nPrivate Limited, YPO Gurgaon Chapter Association, ARK \nInfosolutions Asia Pte. Ltd. and ARK Infosolutions Thailand Co. Ltd. \n \nAs on date of this Addendum, Rishi Khemka holds 14,716,749 Equity \nShares of face value of ₹1, representing 13.40% of the issued, \nsubscribed and paid-up Equity Share capital of our Company, on a fully \ndiluted basis. He will transfer 100 Equity Shares of face value of ₹1 to \nARK Business Prosperity Trust, prior to the filing of the Red Herring \nProspectus with the RoC. Upon completion of the aforesaid transfer, \nhe will hold 14,716,649 Equity Shares of face value of ₹1, representing \n13.40% of the issued, subscribed and paid-up Equity Share capital of \nour Company. \n \nOur Company confirms that the permanent account number, Aadhaar card number, driving license number, \nbank account number and the passport number of Rishi Khemka, will be submitted to the Stock Exchanges \nat the time of filing this Addendum. \n \nOther than as disclosed in this section under “– Entities forming part of the Promoter Group” on page 22 of \nthis Addendum, and in “Our Management – Board of Directors” on page 258 of the Draft Red Herring \nProspectus, our Promoters are not involved in any other ventures. \n \nHari Khemka Business Family Trust (“Hari Khemka Trust”) \n \nTrust information and history \n \nThe Hari Khemka Trust was formed as a private, irrevocable, and discretionary trust pursuant to a deed of \ntrust dated September 17, 2024 (“Trust Deed”). The office of the Hari Khemka Trust is located at B-51, \nGreater Kailash Part I, New Delhi – 110 048, Delhi, India. Hari Shanker Khemka is the settlor of the Hari \nKhemka Trust. \n \nPAN: AADTH1455R \n \nAs on the date of this Addendum, the Hari Khemka Trust does not hold any Equity Shares in the Company. \nPursuant to the Inter-se Agreement, our individual Promoter, Hari Shanker Khemka will transfer 19,719,150 \nEquity Shares of face value of ₹1 each to Hari Khemka Trust, prior to the filing of the Red Herring Prospectus \nwith the RoC. Upon completion of the aforesaid transfer, Hari Khemka Trust will hold 19,719,150 Equity \nShares of face value of ₹1 each, representing 17.96%, of the issued, subscribed and paid-up Equity Share \ncapital of our Company.  \n \nTrustees \n",
        "tables": [],
        "key_findings": "Rishi Khemka, aged 47 years, is one of our Promoters. He has approximately 19 years of experience in the value-added services sector. He will transfer 100 Equity Shares of face value of ₹1 to ARK Business Prosperity Trust. The office of the Hari Khemka Trust is located at B-51, Greater Kailash Part I, New Delhi – 110 048, Delhi, India. As on the date of this Addendum, the Hari Khemka Trust does not hold any Equity Shares in the Company."
    },
    {
        "section_number": 20,
        "chapter_name": "Chapter 20",
        "company_name": "Unknown",
        "full_text": " \n19 \n \n \nAs on the date of this Addendum, the trustees of the Hari Khemka Trust are Aditya Khemka and Hari Shanker \nKhemka.  \n \nBeneficiaries \n \nThe beneficiaries of the Hari Khemka Trust are Aditya Khemka and Hari Khemka Private Family Trust.  \n \nObjects and purpose \n \nPursuant to the Trust Deed, the objects and purpose of the Hari Khemka Trust are:  \n \na) To give effect to the intention of the settlor to arrange the family affairs and consolidation of family \nwealth as well as to ensure peace and security of the family, avoiding litigation and saving family’s \nhonor and settle conflicting interests within the family.  \n \nb) To ensure effective succession planning and intergenerational transfer of trust property for the benefit \nof the beneficiaries. \n \nc) To provide the target entity with good governance and robust monitoring mechanism for the growth of \nthe target entity. \n \nd) To provide for consolidation and protection of assets settled or received by the trust for the benefit of \nthe beneficiaries. \n \ne) To undertake investment activities in movable and immovable assets for the benefit of the beneficiaries. \n \nf) \nTo provide controlled outflow/ distribution towards medical, educational, and other financial/non-\nfinancial needs of beneficiaries to ensure that the family works hard for their benefits and does not \nexploit the trust assets. \n \ng) To oversee the functioning of business entities by the trust in a fiduciary capacity for the benefit of the \nfuture generation of Aditya Khemka. \n \nChange in control of the Hari Khemka Trust \n \nThere has been no change in control of the Hari Khemka Trust in the three years immediately preceding the \ndate of this Addendum. \n \nOur Company confirms that the PAN of Hari Khemka Trust were submitted to the Stock Exchanges at the \ntime of filing of this Draft Red Herring Prospectus. Further, our Company confirms that the bank account \nnumber of Hari Khemka Trust were submitted to the Stock Exchanges at the time of filing of the Draft Red \nHerring Prospectus. \n \nB. \nThe sub-section titled “– Change in control of our Company” beginning on page 282 of the Draft Red \nHerring Prospectus stands replaced with the following: \n \nChange in control of our Company \n \nPursuant to a Board resolution dated September 23, 2024, our Company has identified Hari Shanker Khemka, \nAditya Khemka, Ananmay Khemka and Hari Khemka Business Family Trust as the Promoters of our \nCompany. Rishi Khemka was identified as a Promoter of our Company pursuant to the Board resolution \ndated December 17, 2024. However, there has not been any change in the control of our Company in the five \nyears immediately preceding the date of this Addendum. \n \nC. \nThe sub-section titled “– Interests of Promoters” beginning on page 282 of the Draft Red Herring Prospectus \nstands replaced with the following: \n \n",
        "tables": [],
        "key_findings": "The trustees of the Hari Khemka Trust are Aditya Khemkas and Hari Shanker Khemksa. The beneficiaries of the trust are Aditya Khemka and Hari KhemKA Private Family Trust. There has been no change in control of the Trust in the three years immediately preceding the date of this Addendum. The sub-section titled “– Interests of Promoters” beginning on page 282 of the Draft Red Herring Prospectus stands replaced with the following: Change in control of our Company Pursuant to a Board resolution dated September 23, 2024, our Company has identified Hari Shanker Khemka, Aditya Khemkas, Ananmay KhemKA and Hari Khem Ka Business Family Trust as the Promoters of"
    },
    {
        "section_number": 21,
        "chapter_name": "Chapter 21",
        "company_name": "Unknown",
        "full_text": " \n20 \n \nInterests of Promoters \n \nOur Promoters are interested in our Company to the extent that they are the Promoters of our Company and \nto the extent of their respective shareholding in our Company, their directorship in our Company and the \ndividends payable, if any, and any other distributions in respect of their respective shareholding in our \nCompany, the shareholding of their relatives in our Company, and the shareholding of entities in which our \nPromoters are interested, in our Company. For details of the shareholding of our Promoters in our Company, \nsee “Capital Structure” beginning on page 99 of the Draft Red Herring Prospectus.  \n \nFurther, our Promoters are also directors on the boards, or are shareholders, kartas, trustees, proprietors, \nmembers or partners of entities with which our Company has had related party transactions and may be \ndeemed to be interested to the extent of the payments made by our Company, if any, to these entities. For \nfurther details of interest of our Promoters in our Company, see “Other Financial Information – Related \nParty Transactions” beginning on page 356 of the Draft Red Herring Prospectus. \n \nOur Promoters, Hari Shanker Khemka, Aditya Khemka and Ananmay Khemka may also be deemed to be \ninterested to the extent of remuneration, benefits, reimbursement of expenses payable to them as Directors \non our Board. For further details, see “Our Management – Interest of Directors” on page 264 of the Draft \nRed Herring Prospectus.  \n \nExcept as stated below and in “Restated Consolidated Financial Information – Note 44 – Related Party \nTransactions” on page 334 of the Draft Red Herring Prospectus and as stated below, none of our Promoters \nhave any interest, whether direct or indirect, in any property acquired by our Company within the preceding \nthree years from the date of this Addendum or proposed to be acquired by it as on the date of this Addendum, \nor in any transaction by our Company for acquisition of land, construction of building or supply of machinery: \n \nA. Our Company has entered into a lease agreement dated April 1, 2023 with our individual Promoters, \nHari Shanker Khemka and Aditya Khemka (“Lease Agreement”) for their accommodation at B-51, \nGreater Kailash Part-I, Delhi – 110 048, Delhi, India. Pursuant to the Lease Agreement, our Company \npays ₹7.5 million annually to each of our individual Promoters, Hari Shanker Khemka and Aditya \nKhemka. \n \nB. Our individual Promoters, Hari Shanker Khemka who is a promoter, director and a shareholder in ARK \nInfosolutions Private Limited, Aditya Khemka who is a director in ARK Infosolutions Private Limited \nand Rishi Khemka who is a promoter, director and a shareholder of ARK Infosolutions Private Limited \nhave entered into transfer deed cum sale deed and lease agreements with our Company. For further \ndetails, in relation to such transfer deed cum sale deed and lease agreements, see “Group Companies – \nNature and extent of interest of our Group Company – Interest in transactions for acquisition of land, \nconstruction of building, or supply of machinery” on page 403 of the Draft Red Herring Prospectus.  \n \nExcept for Hari Shanker Khemka, Aditya Khemka and Rishi Khemka, who are directors in ARK \nInfosolutions Private Limited and are designated partners of Aditya Colonizers LLP and Trend Setter \nPromoters LLP, our Promoters are not interested as a member in any firm or company which has any interest \nin our Company. Further, except in accordance to the loan agreement entered between our Company and \nTrend Setter Promoters LLP in relation to the inter-corporate unsecured loan, no sum has been paid or agreed \nto be paid to any of our Promoters or to any firm or company in which any of our Promoters are interested \nas a member, in cash or shares or otherwise by any person either to induce any of our Promoters to become, \nor qualify them as a director, or otherwise for services rendered by any of our Promoters or by such firm or \ncompany in connection with the promotion or formation of our Company. Furthermore, our Company has \nleased its property pursuant to a lease agreement dated May 8, 2023, located at ‘First floor, F-28, Okhla \nIndustrial Area, Phase – I, New Delhi – 110 020’ to Trend Setter Promoters LLP for a period of two years \ncommencing from May 1, 2023. \n \nOur Promoters do not have any interest in any venture that is involved in any activities similar to those \nconducted by our Company.  \n \n",
        "tables": [],
        "key_findings": "Our Promoters are also directors on the boards, or are shareholders, kartas, trustees, proprietors, members or partners of entities with which our Company has had related party transactions. For further details of interest of our Promoters in our Company, see “Other Financial Information – Related Party Transactions” beginning on page 356 of the Draft Red Herring Prospectus. Our individual Promoters, Hari Shanker Khemka, Aditya Khemkas have entered into transfer deed cum sale deed and lease agreements with our Company. Pursuant to the Lease Agreement, our Company pays ₹7.5 million annually to each of our individual Promotors. Our Promoters are not interested as a member in any firm or company which has any interest in our company. No sum has been paid or agreed to be paid to any of our Promoters. Trend Setter Promoters LLP has been awarded a two-year contract by the Delhi Stock Exchange. The deal is expected to be completed by May 1, 2023."
    },
    {
        "section_number": 22,
        "chapter_name": "Chapter 22",
        "company_name": "Unknown",
        "full_text": " \n21 \n \nD. \nThe sub-section titled “– Companies or firms from which our Promoters have disassociated in the last three \nyears” beginning on page 283 of the Draft Red Herring Prospectus stands replaced with the following: \n \nCompanies or firms from which our Promoters have disassociated in the last three years \n \nExcept for the following, none of our Promoters have disassociated themselves from any other company or \nfirm in the three years preceding the date of this Addendum:  \n \nE. \nThe sub-section titled “– Promoter Group” beginning on page 284 of the Draft Red Herring Prospectus \nstands replaced with the following: \n \nPromoter Group \n \nIn addition to our Promoters, the individuals and entities that form a part of the Promoter Group of our \nCompany in terms of Regulation 2(1)(pp) of the SEBI ICDR Regulations, are set out below:  \n \nNatural persons who are part of the Promoter Group  \n \nThe individuals that form part of the Promoter Group are as follows: \n \nS. No. \nName of Promoter \nName of members of the Promoter \nGroup \nRelationship with Promoter \n1.  \nHari Shanker Khemka \nAnand Kumar Khemka \nBrother \nSurendra Kumar Khemka \nBrother \nAditya Khemka \nSon \nRishi Khemka \nSon \nPooja Singhal \nDaughter \nMukesh Bansal \nSpouse’s brother \nNirmal Agarwal \nSpouse’s sister \nChitra Goyal \nSpouse’s sister \n2.  \nAditya Khemka \nHari Shanker Khemka  \nFather \nShradha Khemka \nSpouse \nAnanmay Khemka \nSon \nAdvay Khemka \nSon \nRishi Khemka \nBrother \nPooja Singhal \nSister \nDeoki Nandan Agarwal \nSpouse’s father \nLaxmi Agarwal \nSpouse’s mother \nVatsal Agarwal \nSpouse’s brother \nDeepika Gupta \nSpouse’s sister \nMeenu Halwasiya \nSpouse’s sister \nSneha Sharma \nSpouse’s sister \n3.  \nAnanmay Khemka \nShradha Khemka \nMother \nAditya Khemka \nFather \nAdvay Khemka \nBrother \n4.  \nRishi Khemka \nHari Shanker Khemka \nFather \nRuchi Khemka \nSpouse \nAtharva Khemka \nSon \nAditya Khemka \nBrother \nPooja Singhal \nSister \nRamesh Chander Gupta \nSpouse’s father \nS. No. \nName of the entity from \nwhich our Promoter has \ndisassociated \nPromoter \nDate of \ndisassociation \nReason for \ndisassociation \n1.  \nAditya Security and Safety \nLLP \nHari Shanker Khemka, \nAditya Khemka and Rishi \nKhemka \nApril 1, 2023 \nPre-occupation \n",
        "tables": [],
        "key_findings": "The sub-section titled “– Companies or firms from which our Promoters have disassociated in the last three years” beginning on page 283 of the Draft Red Herring Prospectus stands replaced with the following: Promoter Group. The individuals and entities that form a part of the Promoter group of our Company are set out below. Aditya Khemka has disassociated himself from the entity from which he was Promoter. The reason for the disassociation was that he had a pre-occupation."
    },
    {
        "section_number": 23,
        "chapter_name": "Chapter 23",
        "company_name": "Unknown",
        "full_text": " \n22 \n \nS. No. \nName of Promoter \nName of members of the Promoter \nGroup \nRelationship with Promoter \nKrishna Gupta \nSpouse’s mother \nAkshat Gupta \nSpouse’s brother \nPreeti Rajeshkumar Mittal  \nSpouse’s sister \nShweta Goyal \nSpouse’s sister \nPooja Agarwal \nSpouse’s sister \nNeha Gupta \nSpouse’s sister \n \nEntities forming part of the Promoter Group  \n \nIn addition to our Promoters, the entities that form a part of the Promoter Group, are as follows: \n \nS. No \nName of members of the Promoter Group  \n1. \n \nAditya Colonizers LLP \n2. \n \nAditya Infosolutions Private Limited \n3. \n \nAditya Khemka (HUF) \n4. \n \nAditya Khemka Business Family Trust \n5. \n \nAditya Promoters Limited \n6. \n \nAditya Security & Safety LLP \n7. \n \nAdvance Enterprises Private Limited \n8. \n \nAdvanced Reality Solutions LLP \n9. \n \nAdvance Ispat (India) Ltd  \n10.  \nAlexis Marketing LLP \n11.  \nAlvaro Boards & Panels India Private Limited \n12.  \nAlvaro Hospitality Ventures LLP \n13.  \nAlvaro Oil Resources LLP \n14.  \nAnand Kumar Khemka (HUF) \n15.  \nArcee Ispat Udyog Private Limited \n16.  \nARK Business Prosperity Trust \n17.  \nARK Infosolutions (Thailand) Company Limited \n18.  \nARK Infosolutions Asia Pte. Ltd. \n19.  \nARK Infosolutions Private Limited \n20.  \nARK Tech Innovation Private Limited \n21.  \nAtma Ram Parma Nand (Partnership Firm) \n22.  \nDelhi Sales Corporation (Proprietorship Firm)  \n23.  \nDelhi Sales Plywoods (Partnership Firm) \n24.  \nDeoki Nandan Agarwal (HUF) \n25.  \nElysiann Beautificatiion Private Limited \n26.  \nHari Khemka Private Family Trust \n27.  \nHari Shankar Khemka (HUF)  \n28.  \nKalpataru Housefin & Trading Private Limited \n29.  \nKruti Pipes Limited \n30.  \nPooja S Designs (Partnership Firm) \n31.  \nR C Gupta (HUF) \n32.  \nRiddhi Steel and Tube Limited \n33.  \nRishi Khemka Business Family Trust \n34.  \nRishi Khemka (HUF) \n35.  \nSurendra Kumar Khemka (HUF) \n36.  \nTAK Buildtech Private Limited \n37.  \nTechzzler International Private Limited \n38.  \nTirumala Jewels \n39.  \nTirupati Structurals Ltd \n40.  \nTrend Setter Promoters LLP \n41.  \nTrendsetters Infoservices LLP \n42.  \nTSL Piping Solutions Private Limited \n \n \n",
        "tables": [],
        "key_findings": "The Promoter Group includes Krishna Gupta Spouse’s mother Akshat Gupta, his brother Preeti Rajeshkumar Mittal, Shweta Goyal, Pooja Agarwal and Neha Gupta. In addition to our Promoters, the entities that form a part of the Promoter group are as follows: 34. Rishi Khemka (HUF) 35. Surendra Kumar Khemka (HUF) 36. TAK Buildtech Private Limited 37. Techzzler International Private Limited 38. Tirumala Jewels 39. Tirupati Structurals Ltd 40. Trend Setter Promoters LLP 41. Trendsetters Infoservices LLP 42. TSL Piping Solutions Private Limited"
    },
    {
        "section_number": 24,
        "chapter_name": "Chapter 24",
        "company_name": "Unknown",
        "full_text": " \n23 \n \nSECTION IX - OTHER REGULATORY AND STATUTORY DISCLOSURES \n \nA. \nThe sub-section titled “– Authority for the Offer” beginning on page 404 of the Draft Red Herring Prospectus \nstands replaced with the following:  \n \nAuthority for the Offer \n \nThe Offer has been authorised by a resolution of our Board dated September 27, 2024 and the Fresh Issue \nhas been authorised by a special resolution of our Shareholders dated September 27, 2024. Further, our Board \nhas taken on record the consents of the Selling Shareholders to participate in the Offer for Sale pursuant to \na resolution passed at its meeting held on September 27, 2024. \n \nThe Board has approved the Draft Red Herring Prospectus pursuant to their resolution dated September 30, \n2024.  \n \nFurther, our Board has approved this Addendum to Draft Red Herring Prospectus pursuant to their resolution \ndated December 17, 2024. \n \nEach of the Selling Shareholders has, severally and not jointly, consented and/or authorised for inclusion of \ntheir portion of the Offered Shares as part of the Offer for Sale, as set out below:  \n \nName \nType \nAggregate amount of Offer \nfor Sale \nDate of Selling \nShareholders’ consent \nletter \nAditya Khemka \nPromoter \nUp to ₹5,240.04 million \nSeptember 27, 2024 \nAnanmay Khemka \nPromoter  \nUp to ₹123.16 million \nSeptember 27, 2024 \nRishi Khemka \nPromoter \nUp to ₹2,000.00 million \nSeptember 27, 2024 \nHari Shankar Khemka (HUF) \nPromoter Group  \nUp to ₹426.40 million \nSeptember 27, 2024 \nShradha Khemka \nPromoter Group  \nUp to ₹198.90 million \nSeptember 27, 2024 \nAditya Khemka (HUF) \nPromoter Group  \nUp to ₹11.50 million \nSeptember 27, 2024 \n \nOur Company has received in-principle approvals from the BSE and the NSE for the listing of the Equity \nShares pursuant to letters dated [●] and [●], respectively. \n \n \n \n \n \n",
        "tables": [],
        "key_findings": "The Company has received in-principle approvals from the BSE and the NSE for the listing of the Equity Shares pursuant to letters dated [●] and [●], respectively."
    },
    {
        "section_number": 25,
        "chapter_name": "Chapter 25",
        "company_name": "Unknown",
        "full_text": " \n24 \n \nDECLARATION \n \nI hereby certify and declare that all relevant provisions of the Companies Act, 2013 and the rules, guidelines / \nregulations issued by the Government of India and the rules, guidelines or regulations issued by the SEBI, \nestablished under Section 3 of the SEBI Act, as the case may be, have been complied with and no statement made \nin this Addendum is contrary to the provisions of the Companies Act, the SCRA, the SCRR, the SEBI Act, each \nas amended, and or the rules made or guidelines or regulations issued thereunder, as the case may be. I further \ncertify that all the disclosures and statements made in this Addendum are true and correct. \n \nSIGNED BY THE DIRECTOR OF OUR COMPANY  \n \n \n \n \n_____________________________________________ \nHari Shanker Khemka \n(Chairman and Whole-time Director) \n \nPlace: Noida \n \nDate: December 17, 2024 \n \n \n",
        "tables": [],
        "key_findings": "Hari Shanker Khemka declares that all relevant provisions of the Companies Act, 2013 and the rules, guidelines / regulations issued by the Government of India have been complied with. I further certify that all the disclosures and statements made in this Addendum are true and correct."
    },
    {
        "section_number": 26,
        "chapter_name": "Chapter 26",
        "company_name": "Unknown",
        "full_text": " \n25 \n \nDECLARATION \n \nI hereby certify and declare that all relevant provisions of the Companies Act, 2013 and the rules, guidelines / \nregulations issued by the Government of India and the rules, guidelines or regulations issued by the SEBI, \nestablished under Section 3 of the SEBI Act, as the case may be, have been complied with and no statement made \nin this Addendum is contrary to the provisions of the Companies Act, the SCRA, the SCRR, the SEBI Act, each \nas amended, and or the rules made or guidelines or regulations issued thereunder, as the case may be. I further \ncertify that all the disclosures and statements made in this Addendum are true and correct. \n \nSIGNED BY THE DIRECTOR OF OUR COMPANY  \n \n \n \n \n_____________________________________________ \nAditya Khemka \n(Managing Director) \n \nPlace: Noida, Uttar Pradesh, India \n \nDate: December 17, 2024 \n \n",
        "tables": [],
        "key_findings": "Aditya Khemka declares that all relevant provisions of the Companies Act, 2013 and the rules, guidelines / regulations issued by the Government of India have been complied with. I further certify that all the disclosures and statements made in this Addendum are true and correct."
    },
    {
        "section_number": 27,
        "chapter_name": "Chapter 27",
        "company_name": "Unknown",
        "full_text": " \n26 \n \nDECLARATION \n \nI hereby certify and declare that all relevant provisions of the Companies Act, 2013 and the rules, guidelines / \nregulations issued by the Government of India and the rules, guidelines or regulations issued by the SEBI, \nestablished under Section 3 of the SEBI Act, as the case may be, have been complied with and no statement made \nin this Addendum is contrary to the provisions of the Companies Act, the SCRA, the SCRR, the SEBI Act, each \nas amended, and or the rules made or guidelines or regulations issued thereunder, as the case may be. I further \ncertify that all the disclosures and statements made in this Addendum are true and correct. \n \nSIGNED BY THE DIRECTOR OF OUR COMPANY  \n \n \n \n \n_____________________________________________ \nAnanmay Khemka  \n(Whole-time Director) \n \nPlace: Noida, Uttar Pradesh, India \n \nDate: December 17, 2024 \n",
        "tables": [],
        "key_findings": "Ananmay Khemka declares that all relevant provisions of the Companies Act, 2013 and the rules, guidelines / regulations issued by the Government of India have been complied with. I further certify that all the disclosures and statements made in this Addendum are true and correct."
    },
    {
        "section_number": 28,
        "chapter_name": "Chapter 28",
        "company_name": "Unknown",
        "full_text": " \n27 \n \nDECLARATION \n \nI hereby certify and declare that all relevant provisions of the Companies Act, 2013 and the rules, guidelines / \nregulations issued by the Government of India and the rules, guidelines or regulations issued by the SEBI, \nestablished under Section 3 of the SEBI Act, as the case may be, have been complied with and no statement made \nin this Addendum is contrary to the provisions of the Companies Act, the SCRA, the SCRR, the SEBI Act, each \nas amended, and or the rules made or guidelines or regulations issued thereunder, as the case may be. I further \ncertify that all the disclosures and statements made in this Addendum are true and correct. \n \nSIGNED BY THE DIRECTOR OF OUR COMPANY  \n \n \n \n \n_____________________________________________ \nAtul Behari Lall  \n(Non-Executive Director) \n \nPlace: Noida, Uttar Pradesh, India \n \nDate: December 17, 2024 \n \n",
        "tables": [],
        "key_findings": "Atul Behari Lall (Non-Executive Director) Place: Noida, Uttar Pradesh, India Date: December 17, 2024."
    },
    {
        "section_number": 29,
        "chapter_name": "Chapter 29",
        "company_name": "Unknown",
        "full_text": " \n28 \n \nDECLARATION \n \nI hereby certify and declare that all relevant provisions of the Companies Act, 2013 and the rules, guidelines / \nregulations issued by the Government of India and the rules, guidelines or regulations issued by the SEBI, \nestablished under Section 3 of the SEBI Act, as the case may be, have been complied with and no statement made \nin this Addendum is contrary to the provisions of the Companies Act, the SCRA, the SCRR, the SEBI Act, each \nas amended, and or the rules made or guidelines or regulations issued thereunder, as the case may be. I further \ncertify that all the disclosures and statements made in this Addendum are true and correct. \n \nSIGNED BY THE DIRECTOR OF OUR COMPANY  \n \n \n \n \n_____________________________________________ \nAbhishek Dalmia \n(Independent Director) \n \nPlace: Noida \n \nDate: December 17, 2024 \n \n",
        "tables": [],
        "key_findings": "I certify and declare that all relevant provisions of the Companies Act, 2013 and the rules, guidelines / regulations issued by the Government of India have been complied with. I further certify that all the disclosures and statements made in this Addendum are true and correct."
    },
    {
        "section_number": 30,
        "chapter_name": "Chapter 30",
        "company_name": "Unknown",
        "full_text": " \n29 \n \nDECLARATION \n \nI hereby certify and declare that all relevant provisions of the Companies Act, 2013 and the rules, guidelines / \nregulations issued by the Government of India and the rules, guidelines or regulations issued by the SEBI, \nestablished under Section 3 of the SEBI Act, as the case may be, have been complied with and no statement made \nin this Addendum is contrary to the provisions of the Companies Act, the SCRA, the SCRR, the SEBI Act, each \nas amended, and or the rules made or guidelines or regulations issued thereunder, as the case may be. I further \ncertify that all the disclosures and statements made in this Addendum are true and correct. \n \nSIGNED BY THE DIRECTOR OF OUR COMPANY  \n \n \n \n \n_____________________________________________ \nManish Sharma  \n(Independent Director) \n \nPlace: Noida, Uttar Pradesh, India \n \nDate: December 17, 2024 \n \n",
        "tables": [],
        "key_findings": "Manish Sharma (Independent Director) Place: Noida, Uttar Pradesh, India Date: December 17, 2024."
    },
    {
        "section_number": 31,
        "chapter_name": "Chapter 31",
        "company_name": "Unknown",
        "full_text": " \n30 \n \nDECLARATION \n \nI hereby certify and declare that all relevant provisions of the Companies Act, 2013 and the rules, guidelines / \nregulations issued by the Government of India and the rules, guidelines or regulations issued by the SEBI, \nestablished under Section 3 of the SEBI Act, as the case may be, have been complied with and no statement made \nin this Addendum is contrary to the provisions of the Companies Act, the SCRA, the SCRR, the SEBI Act, each \nas amended, and or the rules made or guidelines or regulations issued thereunder, as the case may be. I further \ncertify that all the disclosures and statements made in this Addendum are true and correct. \n \nSIGNED BY THE DIRECTOR OF OUR COMPANY  \n \n \n \n \n_____________________________________________ \nAmbika Sharma  \n(Independent Director) \n \nPlace: Noida \n \nDate: December 17, 2024 \n \n",
        "tables": [],
        "key_findings": "Ambika Sharma (Independent Director) Place: Noida Date: December 17, 2024. 30 DECLARATION I certify and declare that all relevant provisions of the Companies Act, 2013 and the rules, guidelines / regulations issued by the Government of India have been complied with."
    },
    {
        "section_number": 32,
        "chapter_name": "Chapter 32",
        "company_name": "Unknown",
        "full_text": " \n31 \n \nDECLARATION \n \nI hereby certify and declare that all relevant provisions of the Companies Act, 2013 and the rules, guidelines / \nregulations issued by the Government of India and the rules, guidelines or regulations issued by the SEBI, \nestablished under Section 3 of the SEBI Act, as the case may be, have been complied with and no statement made \nin this Addendum is contrary to the provisions of the Companies Act, the SCRA, the SCRR, the SEBI Act, each \nas amended, and or the rules made or guidelines or regulations issued thereunder, as the case may be. I further \ncertify that all the disclosures and statements made in this Addendum are true and correct. \n \nSIGNED BY THE DIRECTOR OF OUR COMPANY  \n \n \n \n \n_____________________________________________ \nChetan Kajaria \n(Independent Director) \n \nPlace: Noida \n \nDate: December 17, 2024 \n \n \n \n \n",
        "tables": [],
        "key_findings": "I certify and declare that all relevant provisions of the Companies Act, 2013 and the rules, guidelines / regulations issued by the Government of India have been complied with. I further certify that all the disclosures and statements made in this Addendum are true and correct."
    },
    {
        "section_number": 33,
        "chapter_name": "Chapter 33",
        "company_name": "Unknown",
        "full_text": " \n32 \n \nDECLARATION \n \nI hereby certify and declare that all relevant provisions of the Companies Act, 2013 and the rules, guidelines / \nregulations issued by the Government of India and the rules, guidelines or regulations issued by the SEBI, \nestablished under Section 3 of the SEBI Act, as the case may be, have been complied with and no statement made \nin this Addendum is contrary to the provisions of the Companies Act, the SCRA, the SCRR, the SEBI Act, each \nas amended, and or the rules made or guidelines or regulations issued thereunder, as the case may be. I further \ncertify that all the disclosures and statements made in this Addendum are true and correct. \n \nSIGNED BY THE CHIEF FINANCIAL OFFICER OF OUR COMPANY \n \n \n \n \n \n_____________________________________________ \nYogesh Chand Sharma  \n(Chief Financial Officer) \n \nPlace: Noida \n \nDate: December 17, 2024 \n \n",
        "tables": [],
        "key_findings": "Yogesh Chand Sharma (Chief Financial Officer) Place: Noida Date: December 17, 2024."
    },
    {
        "section_number": 34,
        "chapter_name": "Chapter 34",
        "company_name": "Unknown",
        "full_text": " \n33 \n \nDECLARATION \n \nI hereby confirm that all statements, disclosures and undertakings specifically made or confirmed by me in this \nAddendum about or in relation to me and the Equity Shares being offered by me in the Offer, are true and correct. \nI assume no responsibility, for any other statements, disclosures or undertakings including, any of the statements, \ndisclosures or undertakings made or confirmed by the Company or any other Selling Shareholder or any other \nperson(s) in this Addendum. \n \n \n \n \n \n_____________________________________________ \nAditya Khemka \n \nPlace: Noida \n \nDate: December 17, 2024 \n \n",
        "tables": [],
        "key_findings": "Aditya Khemka: I confirm that all statements, disclosures and undertakings specifically made or confirmed by me in this Addendum about or in relation to me and the Equity Shares being offered by me are true and correct. I assume no responsibility, for any other statements,. disclosures or undertakings including, any of the statements,"
    },
    {
        "section_number": 35,
        "chapter_name": "Chapter 35",
        "company_name": "Unknown",
        "full_text": " \n34 \n \nDECLARATION \n \nI hereby confirm that all statements, disclosures and undertakings specifically made or confirmed by me in this \nAddendum about or in relation to me and the Equity Shares being offered by me in the Offer, are true and correct. \nI assume no responsibility, for any other statements, disclosures or undertakings including, any of the statements, \ndisclosures or undertakings made or confirmed by the Company or any other Selling Shareholder or any other \nperson(s) in this Addendum. \n \n \n \n \n \n_____________________________________________ \nAnanmay Khemka \n \nPlace: Noida \n \nDate: December 17, 2024 \n \n",
        "tables": [],
        "key_findings": "Ananmay Khemka: I confirm that all statements, disclosures and undertakings specifically made or confirmed by me in this Addendum about or in relation to me and the Equity Shares being offered by me are true and correct. I assume no responsibility, for any other statement, disclosures or undertakings."
    },
    {
        "section_number": 36,
        "chapter_name": "Chapter 36",
        "company_name": "Unknown",
        "full_text": " \n35 \n \nDECLARATION \n \nI hereby confirm that all statements, disclosures and undertakings specifically made or confirmed by me in this \nAddendum about or in relation to me and the Equity Shares being offered by me in the Offer, are true and correct. \nI assume no responsibility, for any other statements, disclosures or undertakings including, any of the statements, \ndisclosures or undertakings made or confirmed by the Company or any other Selling Shareholder or any other \nperson(s) in this Addendum. \n \n \n \n \n \n_____________________________________________ \nRishi Khemka \n \nPlace: Noida \n \nDate: December 17, 2024 \n \n",
        "tables": [],
        "key_findings": "Rishi Khemka: I confirm that all statements, disclosures and undertakings specifically made or confirmed by me in this Addendum about or in relation to me and the Equity Shares being offered by me are true and correct. I assume no responsibility, for any other statements,. disclosures or undertakings including, any. of the statements,"
    },
    {
        "section_number": 37,
        "chapter_name": "Chapter 37",
        "company_name": "Unknown",
        "full_text": " \n36 \n \nDECLARATION \n \nWe hereby confirm that all statements, disclosures and undertakings specifically made or confirmed by us in this \nAddendum about or in relation to us and the Equity Shares being offered by us in the Offer, are true and correct. \nWe assume no responsibility, for any other statements, disclosures or undertakings including, any of the \nstatements, disclosures or undertakings made or confirmed by the Company or any other Selling Shareholder or \nany other person(s) in this Addendum. \n \nFor and on behalf of Hari Shankar Khemka (HUF) \n \n \n \n \n \n___________________________________________ \nName: Hari Shanker Khemka \n \nDesignation: Karta \n \nPlace: Noida \n \nDate: December 17, 2024 \n \n",
        "tables": [],
        "key_findings": "We hereby confirm that all statements, disclosures and undertakings specifically made or confirmed by us in this Addendum about or in relation to us and the Equity Shares being offered by us are true and correct. We assume no responsibility, for any other statements,. disclosures or undertakings."
    },
    {
        "section_number": 38,
        "chapter_name": "Chapter 38",
        "company_name": "Unknown",
        "full_text": " \n37 \n \nDECLARATION \n \nI hereby confirm that all statements, disclosures and undertakings specifically made or confirmed by me in this \nAddendum about or in relation to me and the Equity Shares being offered by me in the Offer, are true and correct. \nI assume no responsibility, for any other statements, disclosures or undertakings including, any of the statements, \ndisclosures or undertakings made or confirmed by the Company or any other Selling Shareholder or any other \nperson(s) in this Addendum. \n \n \n \n \n \n______________________________________ \nShradha Khemka \n \nPlace: Delhi \n \nDate: December 17, 2024 \n \n",
        "tables": [],
        "key_findings": "Shradha Khemka: I confirm that all statements, disclosures and undertakings specifically made or confirmed by me in this Addendum about or in relation to me and the Equity Shares being offered by me are true and correct. I assume no responsibility, for any other statements,. disclosures or undertakings including, any of the statements"
    },
    {
        "section_number": 39,
        "chapter_name": "Chapter 39",
        "company_name": "Unknown",
        "full_text": " \n38 \n \nDECLARATION \n \nWe hereby confirm that all statements, disclosures and undertakings specifically made or confirmed by us in this \nAddendum about or in relation to us and the Equity Shares being offered by us in the Offer, are true and correct. \nWe assume no responsibility, for any other statements, disclosures or undertakings including, any of the \nstatements, disclosures or undertakings made or confirmed by the Company or any other Selling Shareholder or \nany other person(s) in this Addendum. \n \nFor and on behalf of Aditya Khemka (HUF) \n \n \n \n \n_____________________________________________ \nName: Aditya Khemka \n \nDesignation: Karta \n \nPlace: Noida \n \nDate: December 17, 2024 \n \n \n \n \n \n",
        "tables": [],
        "key_findings": "Aditya Khemka confirms that all statements, disclosures and undertakings specifically made or confirmed by us in this Addendum are true and correct. We assume no responsibility, for any other statement, disclosures or undertakings."
    }
]