[
    {
        "text": "Our Company was originally incorporated on April 24, 2017 at Chhattisgarh, India as ‘Sambhv Sponge Power Private Limited’, a private limited company under the Companies Act, 2013 and was granted a certiﬁ cate \nof incorporation by the Registrar of Companies, Central Registration Centre on April 25, 2017. Subsequently, the name of our Company was changed to ‘Sambhv Steel Tubes Private Limited’ pursuant to a special \nresolution adopted by our Shareholders on January 16, 2024 to more accurately reﬂ ect the nature of business of our Company, and a fresh certiﬁ cate of incorporation consequent upon change of name was issued to \nour Company by the Registrar of Companies, Central Processing Centre on February 22, 2024. Our Company was then converted into a public limited company under the Companies Act, 2013 pursuant to a special \nresolution adopted by our Shareholders on April 24, 2024, consequent to which, the name of our Company was changed to ‘Sambhv Steel Tubes Limited’ and a fresh certiﬁ cate of incorporation, consequent upon \nchange of name, was issued to our Company by the Registrar of Companies, Central Processing Centre on July 9, 2024. For details in relation to changes in the name and Registered Ofﬁ ce of our Company, see \n“History and Certain Corporate Matters” on page 229 of the Draft Red Herring Prospectus dated September 30, 2024 (“DRHP”), ﬁ led with the Securities and Exchange board of India (“SEBI”) and with BSE Limited and \nNational Stock Exchange of India Limited (together, the “Stock Exchanges”). \nRegistered and Corporate Ofﬁ ce: Ofﬁ ce No. 501 to 511, Harshit Corporate, Amanaka, Raipur 492 001, Chhattisgarh, India\nContact Person: Niraj Shrivastava, Company Secretary and Compliance Ofﬁ cer, Tel: +91 771 2222 360; E-mail: cs@sambhv.com; Website: www.sambhv.com\nCorporate Identity Number: U27320CT2017PLC007918\nOUR PROMOTERS: BRIJLAL GOYAL, SURESH KUMAR GOYAL, VIKAS KUMAR GOYAL, SHEETAL GOYAL, SHASHANK GOYAL AND ROHIT GOYAL\nNOTICE TO INVESTORS: CORRIGENDUM TO THE DRAFT RED HERRING PROSPECTUS DATED SEPTEMBER 30, 2024 (THE “CORRIGENDUM”)\nWith reference to the DRHP dated September 30, 2024, ﬁ led by the Company with SEBI and the Stock Exchanges in relation to the Offer, potential Bidders should note the following:\n1. In addition to the members of the Promoter Group disclosed in “Our Promoters and Promoter Group” on pages 259 to 261 of the DRHP, the following individual (“Additional Promoter Group Member”) also formed \npart of our Promoter Group as on the date of the DRHP in accordance with Regulation 2(1)(pp) of the SEBI ICDR Regulations, and was inadvertently not disclosed in ‘Our Promoters and Promoter Group – Promoter \nGroup – Natural persons who are part of the Promoter Group’ on pages 259 to 260 of the DRHP. Accordingly, our Promoter Group as disclosed in ‘Our Promoters and Promoter Group – Promoter Group – Natural \npersons who are part of the Promoter Group’ on pages 259 to 260 of the DRHP should be read to include:\n \n(a)    Khajani Devi (mother of spouse of Brijlal Goyal) \n \nAs on the date of the DRHP and this Corrigendum, Khajani Devi was in compliance with Regulation 5 of the SEBI ICDR Regulations, to the extent applicable. \n2. The names of certain individuals forming part of the Promoter Group as disclosed in “Our Promoters and Promoter Group—Promoter Group” on page 259 of the DRHP were inadvertently mis-spelt or contained \nerrors, and should be read to be updated as follows: \nName disclosed in the DRHP\nUpdated name\nKamla Devi \nKamla Agrawal\nManju Bansal \nManju Bala\nKishan Agrawal \nKrishna Agrawal\nKhusbu Agrawal\nKhushbu Agrawal \nRatan Agrawal \nRatan Lal Agrawal\nPraveen Bansal\nParveen \nThe information in this Corrigendum modiﬁ es and updates the information in the DRHP, and the DRHP should be read in conjunction with this Corrigendum. Any reference to the words ‘Promoter Group’ in the DRHP \nwill include the Additional Promoter Group Member and the names of the individuals forming part of the Promoter Group shall be read to be updated as above. Please note that this Corrigendum does not reﬂ ect any \nchanges that have occurred between the date of ﬁ ling of the DRHP and the date hereof, and the information included in the DRHP will be suitably updated, including to the extent stated in this Corrigendum, as may \nbe applicable, in the Red Herring Prospectus and the Prospectus, as and when ﬁ led with the RoC, the SEBI and the Stock Exchanges.\nThis Corrigendum shall be made available to public for comments, if any, for a period of 21 days from the date of publication of this Corrigendum in the newspapers where the ﬁ ling of the DRHP was announced in \naccordance with the SEBI ICDR Regulations. Our Company invites the public to give their comments to this Corrigendum with respect to disclosures made in it. The members of the public are requested to send a \ncopy of their comments to the SEBI, to the Company Secretary and the Compliance Ofﬁ cer of our Company and/or to the BRLMs at their respective addresses mentioned herein below. All comments must be received \nby the SEBI, the Company Secretary and the Compliance Ofﬁ cer of our Company and/or the BRLMs at their respective addresses mentioned herein below with respect to disclosures made in this Corrigendum on or \nbefore 5:00 p.m. on December 19, 2024 i.e., 21st day from the date of publication of this Corrigendum in the newspapers where the ﬁ ling of the DRHP was announced in accordance with the SEBI ICDR Regulations. \nAll capitalised terms used in this Corrigendum shall, unless the context otherwise requires, have the meaning ascribed to them in the DRHP.\nBOOK RUNNING LEAD MANAGERS\nREGISTRAR TO THE OFFER\nNuvama Wealth Management Limited\n801 - 804, Wing A, Building No 3,\nInspire BKC, G Block\nBandra Kurla Complex, Bandra East\nMumbai – 400 051, Maharashtra, India\nTel: + 91 22 4009 4400 \nE-mail: sambhv.ipo@nuvama.com\nWebsite:www.nuvama.com\nInvestor grievance e-mail: customerservice.mb@nuvama.com\nContact Person: Pari Vaya\nSEBI Registration No.: INM000013004\nMotilal Oswal Investment Advisors Limited \nMotilal Oswal Tower, Rahimtullah\nSayani Road, Opposite Parel ST Depot\nPrabhadevi, Mumbai 400 025\nMaharashtra, India\nTel: +91 22 7193 4380\nE-mail: sambhv@motilaloswal.com\nWebsite: www.motilaloswalgroup.com\nInvestor grievance e-mail: moiaplredressal@motilaloswal.com\nContact Person: Ritu Sharma/Sankita Ajinkya\nSEBI Registration No.: INM000011005\nKFin Technologies Limited \nSelenium, Tower-B\nPlot No. 31 & 32, Gachibowli, Financial District\nNanakramguda, Hyderabad\nTelangana 500 032, India\nTel: +91 40 6716 2222\nE-mail: sstl.ipo@kﬁ ntech.com\nWebsite: www.kﬁ ntech.com\nInvestor grievance e-mail: einward.ris@kﬁ ntech.com\nContact Person: M. Murali Krishna\nSEBI Registration No.: INR000000221\nFor and on behalf of Sambhv Steel Tubes Limited\n(formerly Sambhv Sponge Power Private Limited and Sambhv Steel Tubes Private Limited)\nOn behalf of the Board of Directors\nSd/-\nPlace: Raipur \nNiraj Shrivastava\nDate: November 28, 2024 \nCompany Secretary and Compliance Ofﬁ cer\nSambhv Steel Tubes Limited is proposing, subject to receipt of requisite approvals, market conditions and other considerations, an initial public offering of its equity shares and has ﬁ led the DRHP dated \nSeptember 30, 2024 with the SEBI and with the Stock Exchanges. The DRHP is available on the website of SEBI at www.sebi.gov.in, and the websites of the BRLMs, i.e., Nuvama Wealth Management Limited at \nwww.nuvama.com and Motilal Oswal Investment Advisors Limited at www.motilaloswalgroup.com and the website of the Company at www.sambhv.com. Any potential investors should note that investment in equity \nshares involves a degree of risk and for details relating to the same, please refer to the Red Herring Prospectus (“RHP”), including the section “Risk Factors” of the RHP, when available. Potential investors should not \nrely on the DRHP ﬁ led with SEBI for making any investment decision.\nThis announcement has been prepared for publication in India and may not be released in the United States. This announcement does not constitute an offer of securities for sale in any jurisdiction, including the United \nStates, and any securities described in this announcement may not be offered or sold in the United States absent registration under the U.S. Securities Act of 1933, as amended, or an exemption from registration. \nAny public offering of securities to be made in the United States will be made by means of a prospectus that may be obtained from the Company and that will contain detailed information about the Company and \nmanagement, as well as ﬁ nancial statements. However, no offering of securities is being made in the United States.\nTHIS IS A PUBLIC ANNOUNCEMENT FOR INFORMATION PURPOSES ONLY AND IS NOT A PROSPECTUS ANNOUNCEMENT AND DOES NOT CONSTITUTE AN INVITATION OR OFFER TO \nACQUIRE, PURCHASE OR SUBSCRIBE TO SECURITIES UNDER THE SECURITIES AND EXCHANGE BOARD OF INDIA (ISSUE OF CAPITAL AND DISCLOSURE REQUIREMENTS) REGULATIONS, \n2018, AS AMENDED (THE “SEBI ICDR REGULATIONS”). INITIAL PUBLIC OFFERING OF EQUITY SHARES ON THE MAIN BOARD OF THE STOCK EXCHANGES IN COMPLIANCE WITH CHAPTER II \nOF THE SEBI ICDR REGULATIONS. NOT FOR RELEASE, PUBLICATION OR DISTRIBUTION DIRECTLY OR INDIRECTLY, OUTSIDE INDIA. \nPUBLIC ANNOUNCEMENT\n(Please scan this \nQR Code to view \nthe Corrigendum)\nSAMBHV STEEL TUBES LIMITED",
        "tables": [
            [
                [
                    "Name disclosed in the DRHP",
                    "Updated name"
                ],
                [
                    "Kamla Devi",
                    "Kamla Agrawal"
                ],
                [
                    "Manju Bansal",
                    "Manju Bala"
                ],
                [
                    "Kishan Agrawal",
                    "Krishna Agrawal"
                ],
                [
                    "Khusbu Agrawal",
                    "Khushbu Agrawal"
                ],
                [
                    "Ratan Agrawal",
                    "Ratan Lal Agrawal"
                ],
                [
                    "Praveen Bansal",
                    "Parveen"
                ]
            ],
            [
                [
                    "BOOK RUNNING LEAD MANAGERS",
                    null,
                    null,
                    null,
                    "REGISTRAR TO THE OFFER"
                ],
                [
                    "",
                    "",
                    "",
                    "",
                    ""
                ],
                [
                    "Nuvama Wealth Management Limited\n801 - 804, Wing A, Building No 3,\nInspire BKC, G Block\nBandra Kurla Complex, Bandra East\nMumbai – 400 051, Maharashtra, India\nTel: + 91 22 4009 4400\nE-mail: sambhv.ipo@nuvama.com\nWebsite:www.nuvama.com\nInvestor grievance e-mail: customerservice.mb@nuvama.com\nContact Person: Pari Vaya\nSEBI Registration No.: INM000013004",
                    "Motilal Oswal Investment Advisors Limited\nMotilal Oswal Tower, Rahimtullah\nSayani Road, Opposite Parel ST Depot\nPrabhadevi, Mumbai 400 025\nMaharashtra, India\nTel: +91 22 7193 4380\nE-mail: sambhv@motilaloswal.com\nWebsite: www.motilaloswalgroup.com\nInvestor grievance e-mail: moiaplredressal@motilaloswal.com\nContact Person: Ritu Sharma/Sankita Ajinkya\nSEBI Registration No.: INM000011005",
                    null,
                    null,
                    "KFin Technologies Limited\nSelenium, Tower-B\nPlot No. 31 & 32, Gachibowli, Financial District\nNanakramguda, Hyderabad\nTelangana 500 032, India\nTel: +91 40 6716 2222\nE-mail: sstl.ipo@kfi ntech.com\nWebsite: www.kfi ntech.com\nInvestor grievance e-mail: einward.ris@kfi ntech.com\nContact Person: M. Murali Krishna\nSEBI Registration No.: INR000000221"
                ]
            ]
        ],
        "key_findings": "No content available."
    }
]